{
    "City": [
        "Louisville", 
        "Danbury", 
        "San Diego", 
        "New York", 
        "Miami", 
        "Saco", 
        "Nolensville", 
        "Washington", 
        "Englewood", 
        "New York", 
        "", 
        "Rockville", 
        "Bakersfield", 
        "Bryan", 
        "Buffalo", 
        "Washington", 
        "Emeryville", 
        "New York", 
        "New York", 
        "Lexington", 
        "Chicago", 
        "", 
        "Philadelphia", 
        "Enumclaw", 
        "New York", 
        "New York", 
        "Madison", 
        "Fredericksburg", 
        "Torrance", 
        "Grand Forks", 
        "", 
        "", 
        "Chicago", 
        "", 
        "", 
        "Charlottesville", 
        "", 
        "Tyler", 
        "Bozeman", 
        "Gettysburg", 
        "", 
        "Killeen", 
        "Philadelphia", 
        "", 
        "Orangeburg", 
        "", 
        "Washington", 
        "", 
        "New York", 
        "Detroit", 
        "", 
        "San Francisco", 
        "Baltimore", 
        "", 
        "New York", 
        "San Ramon", 
        "", 
        "Fargo", 
        "North Andover", 
        "Fargo", 
        "", 
        "San Ramon", 
        "Minneapolis", 
        "", 
        "Fargo", 
        "North Andover", 
        "New York", 
        "Fargo", 
        "", 
        "Dallas", 
        "Palm Desert", 
        "Oakland", 
        "West Palm Beach", 
        "Tampa", 
        "Rosenberg", 
        "Minneapolis", 
        "Palm Beach", 
        "West Palm Beach", 
        "Colorado Springs", 
        "West Palm Beach", 
        "Saint Louis", 
        "", 
        "Phoenix", 
        "New York", 
        "", 
        "Washington", 
        "West Palm Beach", 
        "Reading", 
        "Washington", 
        "", 
        "Peoria", 
        "New York", 
        "", 
        "Washington", 
        "New York", 
        "", 
        "", 
        "Seattle", 
        "San Francisco", 
        "Washington", 
        "Pittsburgh", 
        "Minneapolis", 
        "", 
        "", 
        "", 
        "New York", 
        "Washington", 
        "New York", 
        "Chicago", 
        "Indianapolis", 
        "New York", 
        "New York", 
        "Saint Paul", 
        "Atlanta", 
        "Minneapolis", 
        "", 
        "Leesburg", 
        "New York", 
        "Bethpage", 
        "", 
        "Brooklyn", 
        "Rosenberg", 
        "", 
        "Washington", 
        "Portland", 
        "Pittsfield", 
        "Fargo", 
        "Denver", 
        "Newark", 
        "Cleburne", 
        "", 
        "Norfolk", 
        "New York", 
        "Boulder", 
        "Venice Beach", 
        "Queens", 
        "", 
        "New York", 
        "New York", 
        "", 
        "Washington", 
        "New York", 
        "Alexandria", 
        "New York", 
        "", 
        "Sacramento", 
        "New York", 
        "New Bethlehem", 
        "St. Louis", 
        "New York", 
        "Kokomo", 
        "New York", 
        "", 
        "New York", 
        "Portland", 
        "Fargo", 
        "Venice Beach", 
        "Pensacola", 
        "Cedar Rapids", 
        "Norfolk", 
        "New York", 
        "New York City", 
        "Los Angeles", 
        "New York", 
        "Fargo", 
        "Fargo", 
        "Seattle", 
        "Overland Park", 
        "Seattle", 
        "", 
        "Bingham Farms", 
        "Charlottesville", 
        "New York", 
        "New York", 
        "Providence", 
        "New York", 
        "New York"
    ], 
    "Article Title": [
        "Deli owner posts video of man yelling at employees", 
        "Man charged with hate crime after harassing women at deli", 
        "Jack'd now blurs exact location of its US users", 
        "Both Christians and Hindus protest against muslim hate crimes in India", 
        "Florida cities fail to report hate crimes", 
        "WATCH: Portland Man Charged With Hate Crime After Profanity-Laced Tirade At Sisters Deli [NSFW VIDEO]", 
        "Tennessee's Republican US Senators Lamar Alexander and Bob Corker Help Elevate Victim Status of Muslims Living in America", 
        "People of color beware! NAACP issues advisory for travel in Missouri", 
        "Oh, How I Miss Michele Bachmann", 
        "Rapper Jipsta Returns After Surviving Anti-Gay Hate Crime, Talks Support From RuPaul, Willam & Pandora Boxx", 
        "Dozens brave Fargo rain to protest bigotry, hate speech", 
        "NAACP Issues Missouri Travel Advisory to African Americans", 
        "Community Voices: We all must do more to prevent hate", 
        "Wisconsin Sikh tragedy forms mission to combat hatred", 
        "NAACP Warns Black Travelers To Use 'Extreme Caution' When Visiting Missouri", 
        "He was 12. He had just moved to America. Then his Sikh father was murdered.", 
        "The Hate Report: Could this be the next big, violent protest?", 
        "Sikhs in America: A History of Hate", 
        "AVP has learned of an anti-transgender attack on Staten Island", 
        "Oregon man accused of racially-charged attack gets probation", 
        "Why we still need affirmative action", 
        "Two men attack transgender woman on Staten Island", 
        "More than 100 federal agencies fail to report hate crimes to the FBI's National Database", 
        "Words Can Kill / Michelle Carter", 
        "For more than a century, Sikhs in the US have faced suspicion and violence", 
        "Five years after a massacre, our shared duty to combat hate aimed at Sikhs and Muslims", 
        "5 years after mass shooting, Wisconsin Sikh community remains united to combat hatred", 
        "FBI: Explosive detonated at Minnesota mosque", 
        "Police confirm Minnesota mosque was attacked, FBI takes lead", 
        "Port: North Dakota doesn't need hate crime legislation", 
        "Five Years of Massacre: Sikh Community in US Continue to Hail Act Of Kindness", 
        "WATCH: An explicit, troubling portrait of race divides Texas town", 
        "A white man called her kids the n-word. Facebook stopped her from sharing it.", 
        "Hate crime or act of terror?' FBI probes IED bombing attack on Minnesota mosque дуо RT America", 
        "&#039;Hate crime or act of terror?' FBI probes IED bombing attack on Minnesota mosque", 
        "Opinion/Commentary: Five years later, why Virginians must remember Oak Creek killings", 
        "Sikhs in America: A History Of Hate", 
        "Worshippers suspect hate crime in bombing of MN mosque", 
        "FBI investigators seek suspects in Minnesota mosque bombing", 
        "Minnesota mosque explosion 'deeper and scarier' than threats", 
        "FBI Investigating Bloomington Islamic Center Explosion", 
        "Minnesota mosque explosion \"deeper and scarier\" than threats", 
        "Jarring at Delaware Contemporary, organized by Roberto Lugo, a conversation about racial violence that welcomes all", 
        "Why does the NAACP say it is unsafe for minorities to visit Missouri?", 
        "The Latest: Governor condemns Minnesota mosque bombing", 
        "This woman went to a Bon Jovi concert for her birthday. An act of hatred made her leave.", 
        "Oklahoma Gay Man Files Federal Civil Rights Lawsuit After Home Burned to Ground", 
        "Minnesota mosque explosion: FBI investigating possible hate crime", 
        "Minnesota governor calls mosque bombing an 'act of terrorism'", 
        "Minnesota governor calls mosque bombing 'act of terrorism'", 
        "This woman went to a Bon Jovi concert. An act of hatred made her leave.", 
        "Lafayette business owner feels targeted after salon vandalized", 
        "The Documenting Hate project: Tell us your story", 
        "Blaine County lawsuit alleges heinous hate crimes", 
        "Mosque Bombing 'Hate Crime' дуў Missing Marines дуў 'Concealed Carry' Laws Increase Crime: Patch Morning Briefing", 
        "Chinese Tourists Pose With Nazi Salutes In Germany, Get Arrested", 
        "Minnesota Mosque Bomb: Muslim Groups Offer $10,000 Reward for Information as Islamophobic Trolls Celebrate Incident", 
        "Letter: There are at least two good reasons for hate crime legislation", 
        "Mosque explosion that shattered windows leaves worshippers in fear", 
        "Hate Crime Legislation Is as Pointless as the Death Penalty", 
        "Hate crimes against Muslims in Germany on the rise", 
        "Chinese Tourists Pose With Nazi Salutes In Germany, Get Arrested", 
        "Dayton denounces mosque bombing as 'act of terrorism'", 
        "Minnesota Mosque Bomb: Muslim Groups Offer $10,000 Reward for Information as Islamophobic Trolls Celebrate Incident", 
        "Letter: There are at least two good reasons for hate crime legislation", 
        "Mosque explosion that shattered windows leaves worshippers in fear", 
        "Minnesota Governor Calls Mosque Attack a 'Criminal Act of Terrorism'", 
        "Hate Crime Legislation Is as Pointless as the Death Penalty", 
        "Hate crimes against Muslims in Germany on the rise", 
        "After months of homophobic attacks, Oklahoma gay man files federal lawsuit", 
        "Minnesota governor: Mosque blast an 'act of terrorism'", 
        "FBI, ATF Investigate Minnesota Mosque Bombing", 
        "Suspect yells gay slur before Lake Worth shooting, report says", 
        "Minnesota Governor Calls Mosque Bombing 'Act of Terrorism,' and the White House?", 
        "Police: Bikers assault driver in racially-motivated attack", 
        "Twin Cites anti-war leader speaks out against mosque bombing", 
        "Man fatally shot after defending gay friends in downtown Lake Worth", 
        "Murder victim's family seeks justice; Arrest report points to possible hate crime", 
        "Recent hate crimes lead to \"love lives here\" rally", 
        "Murder Outside a Lake Worth Restaurant Possible Hate Crime", 
        "SABA SoCal Supports Hate Crime Prosecution in Orange County Case", 
        "Witnesses say gunman killed man who protested anti-gay slurs", 
        "Man shot to death defending his gay cousin in shocking hate crime", 
        "Head of Bombed Minnesota Mosque Denounces Trump for Stoking Hate & Violence Against Somali Community", 
        "Man Fatally Shot After Defending Gay Friends From Homophobe Who Threatened To Kill Them 'Like Rats'", 
        "American mosques дуо and American Muslims дуо are being targeted for hate like never before", 
        "Lake Worth deadly shooting deemed possible hate crime rocks city", 
        "American mosques - and American Muslims - are being targeted for hate like never before", 
        "White House defends silence on mosque bombing, says it might have been faked by liberals", 
        "Florida Man Fatally Shot While Allegedly Defending Gay Friends and Relatives From Homophobic Slurs", 
        "SOUTHERN POVERTY LAW CENTER FORUM ON HATE SPEECH", 
        "A Minnesota mosque was bombed дуо and America's failed anti-extremism policies are to blame", 
        "Witness: Accused Shooter Hated Gays, Wanted To Kill Them Like Rats", 
        "Sebastian Gorka: Trump won't comment on Minnesota mosque bombing until 'fake hate crime' ruled out", 
        "Hate-filled attacker hurls eggs, anti-Muslim note at Queens food vendor", 
        "German-Israeli Artist Targets Twitter Over Hate Speech", 
        "Sebastian Gorka defends Trump's silence on Minnesota mosque bombing: It could be a думfake hate crimeдуќ", 
        "Forever the Foreigner дус 'Disturbing' Rise in Hate Crimes Targeting Asian Americans", 
        "Judge Orders Mental Evaluation for SF Hate-Crime Suspect", 
        "Caitlyn Jenner commits a hat crime", 
        "Pittsburgh City Paper joins national initiative sponsored by Pro Publica to document incidents of hate", 
        "White House advisor suggests mosque attack could have been 'fake' hate crime", 
        "Muslim Leaders Condemn White House Official Gorka's Claim Mosque Attack Could Have Been 'Fake'", 
        "Minnesota mosque explosion raises alert of hate crimes in US", 
        "LeT militant from Pakistan killed", 
        "School Is Starting Soon. Will The Trump-Inspired Bullying Continue?", 
        "Man convicted of notorious dragging death gets court review", 
        "French Jewish group ties car ramming near Paris to their complaint about hate crime", 
        "ELECTIONS 2018: GOVERNOR Tio Hardiman talks LGBT rights, gun violence", 
        "New alliance hosts conference to broaden awareness and action against hate crimes", 
        "Are 'Blue Lives Matter' Laws Really Necessary?", 
        "Halal Truck Owner Egged in Apparent Hate Crime", 
        "думTerrorismдуќ", 
        "Trump aide: Mosque bombing may be 'fake hate crime'", 
        "Governor condemns Minnesota mosque bombing", 
        "White House Official Gorka Claims Right Wing Attacks Are 'Fake,' but Data Show Something Different", 
        "Cross Burning and Swastika Placement", 
        "How the White House is politicizing the Minnesota mosque bombing", 
        "Trump Adviser: Minnesota Mosque Bombing May Be 'Fake Hate Crime'", 
        "White House remains silent following Minnesota mosque bombing", 
        "Hate crime suspect set to start mental health treatment, brother heads for trial", 
        "Police: Biker assault on family vans not racially motivated", 
        "Hate crime' charge against Spanish archbishop dismissed", 
        "The KKK once attacked her family. Now she was writing to a former neo-Nazi.", 
        "Trump's Continued Silence on Minn. Mosque Attack 'An Outrage,' Says Rep. Ellison", 
        "US Muslims targeted like never before", 
        "Surviving hate", 
        "Spanish court throws out 'hate crime' complaint against archbishop", 
        "This woman came up with a 'hijab-grabbing' defense", 
        "Upping the charges", 
        "Astoria food truck owner attacked with eggs that contained anti-Muslim note", 
        "Survey Shows Many Hate Crimes Go Unreported By Victims", 
        "Bombings Of Mosques Are Acts Of Terrorism", 
        "BW joins ProPublica's Documenting Hate project", 
        "UK Police 'Hate Crime Sergeant' Urges Marks & Spencer to Include Baby on Men's Toilet Signs", 
        "Muslim vendor egged in Astoria", 
        "Hate crimes soared after UK attacks, but fell soon after: police", 
        "Hate crimes soared after UK attacks, but fell soon after - police", 
        "There Was A Big Increase In Hate Crime After Each Terror Attack This Year", 
        "Police figures reveal hate crime levels peaked in wake of terrorist attacks", 
        "Man gets three months in jail for racially-motivated baseball bat attack in Virginia", 
        "NCAVP mourns the hate violence homicide of TeeTee Dangerfield in College Park, GA", 
        "Ready Sentenced For Hate Crime", 
        "NCAVP mourns the hate violence homicide of Juan Javier Cruz in Lake Worth, FL", 
        "Hate crime reports rose after terror attacks, police say", 
        "Slaying of Sikh gas station employee shocks community accustomed to tragedy", 
        "Sentenced Man Yelled Racial Slurs, Chased Victim With Bat", 
        "Bill tracker: Expanding the protections against ethnic intimidation", 
        "Family calls for hate crime investigation after Pacific house fire", 
        "Muslim woman teaches the 'hijab-grab' technique for self-defense", 
        "New Texas law classifies crimes targeting police and judges as hate crimes", 
        "NCAVP mourns the possible hook-up and hate violence homicides of Glenser Soliman and An Vinh Nguyen near Houston, Texas", 
        "Hate crime reports peaked after three UK terror attacks", 
        "This Report Says More LGBT People Were Killed So Far In 2017 Than In All Of 2016", 
        "Our View: 'Anti-white bias' investigation addresses made-up issue", 
        "AJ Schultz: Address Hate by Empowering Judges and Removing Politics", 
        "No Prison for Man Who Scrawled Anti-White, Racist Abuse on Neighbour's Door, Made Death Threats", 
        "Number of LGBT Americans Murdered In Hate Crimes On the Rise", 
        "Postcards offer love, bolster unity", 
        "ADL and Virginia Attorney General combine efforts to fight hate", 
        "More LGBTQ People Murdered in 2017 Thus Far Than All of Last Year", 
        "REPORT: There Have Already Been More Anti-LGBT Hate Violence Homicides This Year Than in All of Last Year", 
        "More LGBTQ People Have Been Killed in Eight Months This Year Than In All of 2016", 
        "More LGBTQ Deaths Have Happened In 2017 Than All Of Last Year дуо REPORT", 
        "Shaw: Hate crime legislation in ND is long overdue", 
        "Shaw: Hate crime legislation in ND is long overdue", 
        "There's Already Been More Anti-LGBT Hate-Motivated Homicides This Year Than All of 2016", 
        "Trump condemns hate violence after Virginia declares emergency", 
        "There Have Already Been More Anti-LGBT Hate Crimes This Year Than All of 2016", 
        "Trump Condemns Charlottesville Violence, But His Relationship with Extremism Is Complicated", 
        "hate crimes", 
        "Opinion/Editorial: Community faces shock, grief over imposed violence", 
        "It Wasn't Just White Men Who Participated In The 'Unite The Right' Rally", 
        "President Trump, Which думSideдуќ Are You On?", 
        "In RI, leaders 'sickened' by display of hate, violence at Virginia rally", 
        "Police Stood By As Mayhem Mounted in Charlottesville", 
        "To The White Nationalists, I Say: YOU Will Not Replace US."
    ], 
    "URL": [
        "http://www.wlky.com/article/deli-owner-posts-video-of-man-yelling-at-employees-strikes-up-conversation-about-safety/10402385", 
        "http://www.newstimes.com/news/crime/article/Man-charged-with-hate-crime-after-harassing-women-11727988.php", 
        "http://sdgln.com/social/2017/08/02/jackd-now-blurs-exact-location-its-us-users", 
        "http://muslimcommunityreport.com/2017/08/02/both-christians-and-hindus-protest-against-muslim-hate-crimes-in-india/", 
        "http://www.miamiherald.com/opinion/op-ed/article165124207.html", 
        "http://949whom.com/watch-portland-man-charged-with-hate-crime-after-tirade-at-sisters-deli-nsfw-video/", 
        "http://tennesseestar.com/2017/08/03/sens-alexander-and-corker-help-elevate-victim-status-of-muslims-living-in-america/", 
        "https://www.americanbazaaronline.com/2017/08/03/people-of-color-beware-naacp-issues-advisory-for-travel-in-missouri/", 
        "http://www.patheos.com/blogs/dispatches/2017/08/03/oh-miss-michele-bachmann/", 
        "http://www.billboard.com/articles/news/pride/7889674/jipsta-rapper-returns-support-rupaul-ban2oozle", 
        "https://www.mprnews.org/story/2017/08/03/fargo-rally-intolerance", 
        "http://investorplace.com/2017/08/naacp-missouri-travel-advisory/", 
        "http://www.bakersfield.com/opinion/community-voices-we-all-must-do-more-to-prevent-hate/article_d1192d34-77c1-11e7-93ed-b33a4a835243.html", 
        "http://www.theeagle.com/news/nation/wisconsin-sikh-tragedy-forms-mission-to-combat-hatred/article_e6571815-3169-5e84-aea5-4a02add11f3e.html", 
        "http://news.wbfo.org/post/naacp-warns-black-travelers-use-extreme-caution-when-visiting-missouri", 
        "https://www.washingtonpost.com/news/acts-of-faith/wp/2017/08/04/his-father-was-murdered-hes-still-grappling-with-what-it-means-to-be-sikh-in-america/", 
        "https://www.revealnews.org/blog/hate-report-this-could-be-the-next-big-violent-protest/", 
        "https://www.propublica.org/article/sikhs-in-america-hate-crime-victims-and-bias", 
        "https://avp.org/avp-learned-anti-transgender-attack-staten-island/", 
        "http://www.kentucky.com/living/health-and-medicine/article165501197.html", 
        "http://www.chicagotribune.com/news/opinion/letters/ct-why-we-still-need-affirmative-action-20170804-story.html", 
        "http://www.metroweekly.com/2017/08/two-men-attack-transgender-woman-staten-island/", 
        "http://www.philasun.com/stateside/100-federal-agencies-fail-report-hate-crimes-fbis-national-database/", 
        "https://enumclaw.com/news/2017/08/04/words-can-kill-michelle-carter/", 
        "http://www.businessinsider.com/sikh-hate-crimes-discrimination-america-2017-8", 
        "http://www.nydailynews.com/opinion/years-massacre-duty-combat-hate-article-1.3380620", 
        "http://host.madison.com/wsj/news/local/crime/years-after-mass-shooting-wisconsin-sikh-community-remains-united-to/article_bc0c94c2-9191-5450-b81d-9e8695e704c1.html", 
        "http://www.fredericksburg.com/news/news-wire/police-investigate-blast-at-minnesota-mosque-nobody-hurt/article_143a16a9-138c-5630-a973-2c686e543972.html", 
        "http://www.dailybreeze.com/article/LI/20170805/NEWS/170809709", 
        "http://www.wdaz.com/opinion/columns/4307038-port-north-dakota-doesnt-need-hate-crime-legislation", 
        "https://www.newsgram.com/five-years-of-massacre-sikh-community-in-us-continue-to-hail-act-of-kindness/", 
        "http://www.salon.com/2017/08/05/watch-an-explicit-troubling-portrait-of-race-divides-texas-town/", 
        "http://www.chicagotribune.com/bluesky/technology/ct-facebook-hate-speech-20170805-story.html", 
        "http://www.standardrepublic.com/2017/08/hate-crime-or-act-of-terror-fbi-probes-ied-bombing-attack-on-minnesota-mosque-rt-america/14662.htm", 
        "https://newsline.com/039hate-crime-or-act-of-terror-fbi-probes-ied-bombing-attack-on-minnesota-mosque/", 
        "http://www.dailyprogress.com/opinion/opinion-commentary-five-years-later-why-virginians-must-remember-oak/article_e313ed82-7945-11e7-a867-2fe444a5b065.html", 
        "http://www.nationalmemo.com/sikhs-in-america-a-history-of-hate/", 
        "http://www.kltv.com/story/36071907/worshippers-suspect-hate-crime-in-bombing-of-mn-mosque", 
        "http://www.bozemandailychronicle.com/ap_news/us/fbi-investigators-seek-suspects-in-minnesota-mosque-bombing/article_e109cbbf-4564-5d4f-98d5-d33c7d366c3f.html", 
        "http://www.gettysburgtimes.com/news/national/article_7d6b499d-821c-5dd4-87ac-503c92239ac0.html", 
        "https://www.youtube.com/watch?v=tD45x1MoylY", 
        "http://kdhnews.com/news/nation/fbi-investigators-seek-suspects-in-minnesota-mosque-bombing/article_4952cd10-aadb-5ffa-8233-87aeacdeaa60.html", 
        "http://www.theartblog.org/2017/08/jarring-at-delaware-contemporary-organized-by-roberto-lugo-a-conversation-about-emmett-till-and-trayvon-martin-that-welcomes-all/", 
        "http://www.3newsnow.com/news/national/why-does-the-naacp-say-it-is-unsafe-for-minorities-to-visit-missouri", 
        "http://thetandd.com/news/national/the-latest-governor-condemns-minnesota-mosque-bombing/article_f754416c-225d-5b98-8ba6-c6128fb266fd.html", 
        "https://www.usatoday.com/story/news/nation-now/2017/08/06/bon-jovi-concert-discrimination/543974001/", 
        "https://www.hrc.org/blog/oklahoma-gay-man-files-federal-civil-rights-lawsuit-after-home-burned-to-gr", 
        "http://us.blastingnews.com/world/2017/08/minnesota-mosque-explosion-fbi-investigating-possible-hate-crime-001911309.html", 
        "http://uk.businessinsider.com/r-minnesota-governor-calls-mosque-bombing-act-of-terrorism-2017-8", 
        "http://www.freep.com/story/news/nation-now/2017/08/06/minnesota-mosque-bombing-reaction/543794001/", 
        "http://www.standardrepublic.com/2017/08/this-woman-went-to-a-bon-jovi-concert-an-act-of-hatred-made-her-leave/15372.htm", 
        "http://kron4.com/2017/08/06/lafayette-business-owner-feels-targeted-after-salon-vandalized/", 
        "https://baltimorebrew.com/2017/08/07/the-documenting-hate-project-tell-us-your-story/", 
        "https://nondoc.com/2017/08/07/blaine-county-lawsuit-alleges-hate-crimes/", 
        "https://patch.com/us/across-america/mosque-bombing-hate-crime-missing-marines-concealed-carry-laws-increase-crime", 
        "http://www.carbonated.tv/news/chinese-tourists-arrested-for-nazi-hitler-salute-reichstag-germany", 
        "http://www.newsweek.com/minnesota-mosque-muslim-hate-crime-terrorism-647274", 
        "http://www.inforum.com/opinion/letters/4308543-letter-there-are-least-two-good-reasons-hate-crime-legislation", 
        "http://www.eagletribune.com/news/mosque-explosion-that-shattered-windows-leaves-worshippers-in-fear/article_20ddf746-7b6e-11e7-9471-578da6e48914.html", 
        "https://www.sayanythingblog.com/entry/hate-crime-legislation-pointless-death-penalty/", 
        "http://www.trtworld.com/magazine/hate-crimes-against-muslims-in-germany-on-the-rise-415493", 
        "http://www.carbonated.tv/news/chinese-tourists-arrested-for-nazi-hitler-salute-reichstag-germany", 
        "https://www.minnpost.com/glean/2017/08/dayton-denounces-mosque-bombing-act-terrorism", 
        "http://www.newsweek.com/minnesota-mosque-muslim-hate-crime-terrorism-647274", 
        "http://www.inforum.com/opinion/letters/4308543-letter-there-are-least-two-good-reasons-hate-crime-legislation", 
        "http://www.eagletribune.com/news/mosque-explosion-that-shattered-windows-leaves-worshippers-in-fear/article_20ddf746-7b6e-11e7-9471-578da6e48914.html", 
        "https://www.nytimes.com/2017/08/07/us/minnesota-mosque-explosion.html", 
        "https://www.sayanythingblog.com/entry/hate-crime-legislation-pointless-death-penalty/", 
        "http://www.trtworld.com/magazine/hate-crimes-against-muslims-in-germany-on-the-rise-415493", 
        "http://www.dallasvoice.com/months-homophobic-attacks-oklahoma-gay-man-files-federal-lawsuit-10240387.html", 
        "http://www.kesq.com/news/national-world/minnesota-governor-mosque-blast-an-act-of-terrorism/600950563", 
        "https://www.colorlines.com/articles/fbi-atf-investigate-minnesota-mosque-bombing", 
        "http://cbs12.com/news/local/suspect-yells-gay-slur-before-lake-worth-shooting-report-says", 
        "http://farmingtonhills.legalexaminer.com/uncategorized/minnesota-governor-calls-mosque-bombing-act-of-terrorism-and-the-whitehouse/", 
        "http://www.fbherald.com/news/police-bikers-assault-driver-in-racially-motivated-attack/article_d283ea05-7957-5321-9d3d-c1d58ec4c527.html", 
        "http://www.fightbacknews.org/2017/8/7/twin-cites-anti-war-leader-speaks-out-against-mosque-bombing", 
        "http://www.palmbeachpost.com/news/crime--law/man-fatally-shot-after-defending-gay-friends-downtown-lake-worth/AC7e70I6HRotr1B59p3ohM/", 
        "http://cbs12.com/news/local/murder-victims-family-seeks-justice-arrest-report-points-to-possible-hate-crime", 
        "https://www.csindy.com/TheWire/archives/2017/08/07/recent-hate-crimes-lead-to-love-lives-here-rally", 
        "http://www.850wftl.com/murder-outside-lake-worth-restaurant-possible-hate-crime/", 
        "http://www.sabanorthamerica.com/saba-socal-supports-hate-crime-prosecution-in-orange-county-case/", 
        "http://newburghgazette.com/2017/08/08/witnesses-say-gunman-killed-man-who-protested-anti-gay-slurs/", 
        "https://www.lgbtqnation.com/2017/08/man-shot-death-defending-gay-cousin-shocking-hate-crime/", 
        "https://www.democracynow.org/2017/8/8/head_of_bombed_minnesota_mosque_denounces", 
        "http://perezhilton.com/2017-08-08-man-killed-gay-shoot-hate-crime-florida-melson-nema-juan-cruz-defended-homophobe-gun", 
        "http://www.washingtonpost.com/news/wonk/wp/2017/08/08/american-mosques-and-american-muslims-are-being-targeted-for-hate-like-never-before/", 
        "http://cbs12.com/news/local/lake-worth-deadly-shooting-deemed-possible-hate-crime-rocks-city", 
        "http://www.readingeagle.com/ap/article/american-mosques---and-american-muslims---are-being-targeted-for-hate-like-never-before", 
        "https://thinkprogress.org/white-house-defends-silence-on-mosque-bombing-says-it-might-have-been-faked-by-liberals/", 
        "http://people.com/crime/florida-man-killed-allegedly-defended-friends-relatives-anti-gay-slurs/", 
        "http://thecommunityword.com/online/cwnotes/2017/08/08/southern-poverty-law-center-forum-on-hate-speech-2/", 
        "https://mic.com/articles/183426/a-minnesota-mosque-was-bombed-and-americas-failed-anti-extremism-policies-are-to-blame", 
        "http://miami.cbslocal.com/2017/08/08/lake-worth-florida-crime-shooting/", 
        "http://www.washingtonexaminer.com/sebastian-gorka-trump-wont-comment-on-minnesota-mosque-bombing-until-fake-hate-crime-ruled-out/article/2630928", 
        "http://www.nydailynews.com/new-york/attacker-hurls-eggs-anti-muslim-note-queens-food-vendor-article-1.3394379", 
        "http://fortune.com/2017/08/08/twitter-hate-speech-artist/", 
        "http://www.salon.com/2017/08/08/sebastian-gorka-defends-trumps-silence-on-minnesota-mosque-bombing-it-could-be-a-fake-hate-crime/", 
        "http://www.iexaminer.org/2017/08/forever-the-foreigner-disturbing-rise-in-hate-crimes-targeting-asian-americans/", 
        "http://www.nbcbayarea.com/news/local/Judge-Orders-Mental-Evaluation-for-Hate-Crime-Suspect-439316803.html", 
        "http://www.washingtontimes.com/news/2017/aug/8/caitlyn-jenner-commits-a-hat-crime/", 
        "https://www.pghcitypaper.com/pittsburgh/pittsburgh-city-paper-joins-national-initiative-sponsored-by-pro-publica-to-document-incidents-of-hate/Content?oid=3750496", 
        "https://www.minnpost.com/glean/2017/08/white-house-advisor-suggests-mosque-attack-could-have-been-fake-hate-crime", 
        "http://www.newsweek.com/white-house-gorka-mosque-attack-could-be-fake-hate-crime-648384", 
        "http://hitechfacts.com/2017/08/minnesota-mosque-explosion-raises-alert-of-hate-crimes-in-us/", 
        "http://registrarjournal.com/2017/08/09/let-militant-from-pakistan-killed/", 
        "https://www.buzzfeed.com/albertsamaha/school-is-starting-soon-will-the-trump-inspired-bullying", 
        "http://www.mcclatchydc.com/news/politics-government/national-politics/article166209687.html", 
        "http://www.jta.org/2017/08/09/news-opinion/world/french-jewish-group-says-car-ramming-attack-in-paris-highlights-indifference-to-anti-semitism", 
        "http://www.windycitymediagroup.com/lgbt/ELECTIONS-2018-GOVERNOR-Tio-Hardiman-talks-LGBT-rights-gun-violence/60052.html", 
        "https://www.nuvo.net/news/new-alliance-hosts-conference-to-broaden-awareness-and-action-against/article_a0ca93f2-7d0c-11e7-be2b-dbbe6b54a0a4.html", 
        "https://thecrimereport.org/2017/08/09/are-blue-lives-matter-laws-really-necessary/", 
        "https://ny.eater.com/2017/8/9/16118528/food-truck-hate-crime", 
        "http://www.shotinthedark.info/wp/?p=64086", 
        "https://www.youtube.com/watch?v=oHezFEclnB8", 
        "http://minnlawyer.com/2017/08/09/governor-condemns-minnesota-mosque-bombing/", 
        "http://www.newsweek.com/gorka-islamic-extremism-terrorism-right-wing-extremists-648754", 
        "http://www.simmsshowerslaw.com/cross-burning-and-swastika-placement/", 
        "https://mic.com/articles/183525/how-the-white-house-is-politicizing-the-minnesota-mosque-bombing", 
        "https://longislandtechnologynews.com/2017/08/trump-adviser-minnesota-mosque-bombing-may-be-fake-hate-crime/", 
        "http://hitechbeacon.com/2017/08/09/white-house-remains-silent-following-minnesota-mosque.html", 
        "http://www.brooklyneagle.com/articles/2017/8/9/hate-crime-suspect-set-start-mental-health-treatment-brother-heads-trial", 
        "http://www.fbherald.com/news/police-bikers-assault-driver-after-highway-incident/article_96bc5820-766f-55cd-aaab-e5c00f2ee691.html", 
        "http://www.catholicculture.org/news/headlines/index.cfm?storyid=32319", 
        "https://www.washingtonpost.com/local/the-kkk-once-attacked-her-family-now-she-was-writing-to-a-former-neo-nazi/2017/08/09/be143f0a-7319-11e7-8f39-eeb7d3a2d304_story.html", 
        "https://www.commondreams.org/news/2017/08/09/trumps-continued-silence-minn-mosque-attack-outrage-says-rep-ellison", 
        "http://www.berkshireeagle.com/stories/us-muslims-targeted-like-never-before,516310", 
        "http://hpr1.com/index.php/feature/news/surviving-hate/", 
        "http://www.catholicnewsagency.com/news/spanish-court-throws-out-hate-crime-complaint-against-archbishop-95584/", 
        "http://newyorknewsinfo.com/this-woman-came-up-with-a-hijab-grabbing-defense/", 
        "http://www.cleburnetimesreview.com/news/upping-the-charges/article_0051e21c-7d4e-11e7-b7bb-0f389cde1ccd.html", 
        "http://qns.com/story/2017/08/10/astoria-food-truck-owner-attacked-eggs-contained-anti-muslim-note/", 
        "http://thenewjournalandguide.com/2017/08/10/survey-shows-many-hate-crimes-go-unreported-victims/", 
        "http://www.huffingtonpost.com/entry/bombings-of-mosques-are-acts-of-terrorism_us_598c710ee4b08a4c247f28bc", 
        "http://www.boulderweekly.com/news/bw-joins-propublicas-documenting-hate-project/", 
        "http://www.breitbart.com/london/2017/08/10/police-hate-crime-baby-mens-toilet-signs/", 
        "http://www.qchron.com/editions/western/muslim-vendor-egged-in-astoria/article_49d728a9-4a72-5a7e-9d3e-d8e5730bf473.html", 
        "http://www.reuters.com/article/us-britain-hatecrime-idUSKBN1AQ27N?il=0", 
        "http://www.nasdaq.com/article/hate-crimes-soared-after-uk-attacks-but-fell-soon-after--police-20170810-01128", 
        "https://www.buzzfeed.com/patricksmith/there-was-a-big-increase-in-hate-crime-after-each-terror", 
        "http://www.clactonandfrintongazette.co.uk/news/national/15466822.Police_figures_reveal_hate_crime_levels_peaked_in_wake_of_terrorist_attacks/", 
        "https://www.washingtonpost.com/local/public-safety/man-gets-three-months-in-jail-for-racially-motivated-baseball-bat-attack-in-va/2017/08/10/fa725e7e-7df4-11e7-83c7-5bd5460f0d7e_story.html", 
        "https://avp.org/ncavp-mourns-hate-violence-homicide-teetee-dangerfield-college-park-ga/", 
        "http://www.alexandrianews.org/2017/08/ready-sentenced-for-hate-crime/", 
        "https://avp.org/ncavp-mourns-hate-violence-homicide-juan-javier-cruz-lake-worth-fl/", 
        "http://www.bbc.com/news/uk-40891774", 
        "http://www.sacbee.com/news/local/crime/article166530492.html", 
        "https://patch.com/virginia/delray/sentenced-man-yelled-racial-slurs-chased-victim-bat", 
        "http://www.thecourierexpress.com/news/state/bill-tracker-expanding-the-protections-against-ethnic-intimidation/article_08cf59e6-76e4-5af3-acfe-ead8dd984a01.html", 
        "http://fox2now.com/2017/08/10/family-calls-for-hate-crime-investigation-after-pacific-house-fire/", 
        "http://nypost.com/video/muslim-woman-teaches-the-hijab-grab-technique-for-self-defense/", 
        "http://www.kokomotribune.com/cnhi_network/new-texas-law-classifies-crimes-targeting-police-and-judges-as/article_b00e8e59-025d-53b4-bb66-863e6592e2a2.html", 
        "https://avp.org/ncavp-mourns-possible-hook-hate-violence-homicides-glenser-soliman-vinh-nguyen-near-houston-texas/", 
        "http://expressnewsline.com/2017/08/11/hate-crime-reports-peaked-after-three-uk-terror-attacks.html", 
        "https://www.buzzfeed.com/nidhiprakash/lgbt-deaths-mid-2017", 
        "http://www.pressherald.com/2017/08/11/our-view-anti-white-bias-investigation-addresses-made-up-issue/", 
        "https://www.sayanythingblog.com/entry/j-schultz-address-hate-empowering-judges-removing-politics/", 
        "http://www.breitbart.com/london/2017/08/11/no-prison-for-i-hate-you-white-people-man-who-scrawled-racist-abuse-on-neighbours-door-made-death-threats/", 
        "https://trofire.com/2017/08/11/number-lgbt-americans-murdered-hate-crimes-rise/", 
        "http://www.thegazette.com/subject/opinion/blogs/lynda-waddington/postcards-offer-love-bolster-unity-20170811", 
        "http://www.jewishnewsva.org/adl-and-virginia-attorney-general-combine-efforts-to-fight-hate/", 
        "http://www.papermag.com/more-lgbtq-people-murdered-in-2017-thus-far-than-all-of-last-year-2471822094.html", 
        "http://www.thenewcivilrightsmovement.com/davidbadash/report_anti_lgbt_hate_violence_homicides_this_year_on_track_to_double_2016_total", 
        "https://www.out.com/news-opinion/2017/8/11/more-lgbtq-people-have-been-killed-eight-months-year-all-2016", 
        "https://www.bustle.com/p/more-lgbtq-deaths-have-happened-in-2017-than-all-of-last-year-report-76049", 
        "http://www.inforum.com/opinion/columnists/4309893-shaw-hate-crime-legislation-nd-long-overdue", 
        "http://www.inforum.com/opinion/columnists/4309893-shaw-hate-crime-legislation-nd-long-overdue", 
        "https://unicornbooty.com/theres-already-anti-lgbt-hate-motivated-homicides-year-2016/", 
        "http://gearsofbiz.com/trump-condemns-hate-violence-after-virginia-declares-emergency/7742", 
        "https://unicornbooty.com/anti-lgbt-hate-crimes/", 
        "https://fortune.com/2017/08/12/charlottesville-protest-trump-extremism/", 
        "http://www.benzinga.com/topic/hate-crimes", 
        "http://www.dailyprogress.com/opinion/opinion-editorial-community-faces-shock-grief-over-imposed-violence/article_50a97410-7faf-11e7-974f-5b616a594ea1.html", 
        "http://www.huffingtonpost.com/entry/it-wasnt-just-white-men-who-participated-in-the-unite-the-right-rally_us_598f55b4e4b09071f69a0381", 
        "http://www.huffingtonpost.com/entry/president-trump-which-side-are-you-on_us_598f8f1fe4b0ed1f464c0b48", 
        "http://www.providencejournal.com/news/20170812/in-ri-leaders-sickened-by-display-of-hate-violence-at-virginia-rally", 
        "https://www.propublica.org/article/police-stood-by-as-mayhem-mounted-in-charlottesville", 
        "http://www.huffingtonpost.com/entry/you-will-not-replace-us_us_598fb3aae4b0ed1f464c0b5f"
    ], 
    "State": [
        "KY", 
        "CT", 
        "CA", 
        "NY", 
        "FL", 
        "ME", 
        "TN", 
        "DC", 
        "CO", 
        "NY", 
        "MN", 
        "MD", 
        "CA", 
        "TX", 
        "NY", 
        "DC", 
        "CA", 
        "NY", 
        "NY", 
        "KY", 
        "IL", 
        "", 
        "PA", 
        "WA", 
        "NY", 
        "NY", 
        "WI", 
        "VA", 
        "CA", 
        "ND", 
        "", 
        "", 
        "IL", 
        "", 
        "", 
        "VA", 
        "", 
        "TX", 
        "MT", 
        "PA", 
        "", 
        "TX", 
        "PA", 
        "", 
        "SC", 
        "", 
        "DC", 
        "", 
        "NY", 
        "MI", 
        "", 
        "CA", 
        "Maryland", 
        "", 
        "", 
        "CA", 
        "", 
        "ND", 
        "MA", 
        "ND", 
        "", 
        "CA", 
        "MN", 
        "", 
        "ND", 
        "MA", 
        "NY", 
        "ND", 
        "", 
        "TX", 
        "CA", 
        "CA", 
        "FL", 
        "FL", 
        "Texas", 
        "MN", 
        "FL", 
        "FL", 
        "CO", 
        "FL", 
        "MO", 
        "", 
        "AZ", 
        "NY", 
        "CA", 
        "DC", 
        "FL", 
        "PA", 
        "DC", 
        "", 
        "Illinois", 
        "NY", 
        "", 
        "D.C.", 
        "NY", 
        "", 
        "", 
        "Washington", 
        "CA", 
        "DC", 
        "PA", 
        "MN", 
        "", 
        "", 
        "", 
        "NY", 
        "DC", 
        "NY", 
        "IL", 
        "IN", 
        "NY", 
        "New York", 
        "MN", 
        "GA", 
        "MN", 
        "", 
        "VA", 
        "NY", 
        "NY", 
        "", 
        "NY", 
        "Texas", 
        "", 
        "DC", 
        "ME", 
        "MA", 
        "ND", 
        "CO", 
        "NJ", 
        "TX", 
        "", 
        "VA", 
        "NY", 
        "CO", 
        "CA", 
        "NY", 
        "", 
        "New York", 
        "NY", 
        "", 
        "DC", 
        "NY", 
        "Virginia", 
        "NY", 
        "", 
        "CA", 
        "", 
        "PA", 
        "MO", 
        "NY", 
        "IN", 
        "NY", 
        "", 
        "NY", 
        "ME", 
        "ND", 
        "CA", 
        "FL", 
        "Iowa", 
        "VA", 
        "NY", 
        "NY", 
        "CA", 
        "New York", 
        "ND", 
        "ND", 
        "WA", 
        "KS", 
        "WA", 
        "", 
        "Michigan", 
        "VA", 
        "NY", 
        "NY", 
        "RI", 
        "NY", 
        "NY"
    ], 
    "Summary": [
        "A Maine man has been charged in what police are calling a hate crime after a disturbance at a deli Saturday afternoon.\tJesse James Taylor, 37, was seen on a surveillance camera yelling at employees at Sisters Gourmet Deli in Portland, Maine, and knocking", 
        "PORTLAND, Maine (AP) дуо Police say they charged a man with a hate crime after he repeatedly made derogatory sexual comments to female employees while causing a disturbance at a Portland, Maine, restaurant.\tSisters Gourmet Deli employees called 911", 
        "by Timothy Rawles - Community Editor for SDGLN\tThe dating app Jack'd has taken safety precautions for their US subscribers by blurring the exact locations of people using the service.\tThe company says they started using the feature in notoriously", 
        "", 
        "August 5th is the fifth anniversary of one of the deadliest hate crimes in modern history: a neo-Nazi attack on a gurdwara (Sikh house of worship) in Oak Creek, Wisconsin. As Sikh Americans remember that tragic day, the threat of hate crimes has not", 
        "", 
        "", 
        "By Jayshal Sood | August 3, 2017\tEarlier this year, Indian national Srinivas Kuchibhotla was fatally shot in a hate crime, and his murderer was arrested from Missouri.\tThe National Association for the Advancement of Colored People cautions people of color", 
        "No longer a member of Congress, Michele Bachmann is still spouting the delightfully loopy and ridiculous thoughts in her head. Her latest steaming pile of stupid is claiming that a hotline to report hate crimes is really a fascist attempt to outlaw", 
        "JP Masterson, better known as Jipsta, has had a streak of hits on the Dance Club Songs chart. In fact, his cover of George Michael's думI Want Your Sexдуќ was one of three tracks to hit the chart's top 10 (it peaked at No. 4 in 2009). But in 2014, his", 
        "Umbrellas and rain coats were in ample supply during a community rally against hate speech in downtown Fargo Wednesday. Ann Arbor Miller for MPR News\tA few dozen people braved steady rain to attend a rally against intolerance Wednesday evening in Fargo.", 
        "The warning is designed to bring awareness to Senator Gary Romine's Jim Crow bill дуо SB 43 дуо which makes it more difficult to hold people accountable for racial harassment or discrimination.\tдумYou have violations of civil rights that are happening to", 
        "By Balmeet Singh\tOn Aug. 5, 2012, a neo-Nazi violated the sanctity of a gurdwara, a Sikh house of worship, killing six Americans, injuring others, and shaking the foundation of what it means to be safe as a visible minority in America. Five years later,", 
        "By IVAN MORENO AP\tFILE - In this Aug. 6, 2012 file photo, Oak Creek Mayor Steve Scaffidi speaks during a news conference, in Oak Creek, Wis., where a gunman killed six Sikh Temple Wisconsin members a day earlier. In the five years since the shooting at", 
        "By Camila Domonoske дуў 10 hours ago\tThe NAACP has issued a travel advisory for the state of Missouri, citing recent \"race-based incidents\" and new state legislation that makes it harder for fired employees to prove racial discrimination.\tIt's the first", 
        "OAK CREEK, Wis. дуо Prabhjot Singh Rathor entered the sanctuary and bowed low toward the holy book at the front of the room.\tPrabhjot's father always told him that he must go to the temple every week, so here he was this Sunday, just like every Sunday and", 
        "By Aaron Sankin / August 4, 2017\tIn this week's Hate Report: a rally dubbed думUnited The Rightдуќ has the potential to throw a Virginia city into chaos, a look at why hate crime victims don't report their attackers to police and an alt-right warrior's", 
        "Demonized as immigrants. Mistaken for Muslims. For more than a century, Sikhs in the US have faced suspicion and violence.\tby AC Thompson, ProPublica August 4, 2017\tThe 1907 episode in a seaside timber town in Washington came to be known as the Bellingham", 
        "", 
        "AP\tA 35-year-old man accused of a racist attack on a woman has been sentenced to mental health counseling and two years of probation.\tJoseph Leineweber spent a month in jail after the April attack in Portland and will serve no additional time as part of a", 
        "We still need affirmative action. Most white people are taught not to be racists. We are viscerally offended at the idea of hate crimes that target minorities. We do not want to live in an unjust world.\tYet, we have not yet come to terms with the deep and", 
        "By John Riley on August 4, 2017 @JohnAndresRiley\tTwo men face hate crime charges after they were arrested for beating up a transgender woman in Staten Island's Stapleton neighborhood.\tPolice say Tapharia Jones, 24, and Yaqwa Jones, 20, attacked a", 
        "By AC Thompson and Ken Schwencke\tIn violation of a longstanding legal mandate, scores of federal law enforcement agencies are failing to submit statistics to the FBI's national hate crimes database, ProPublica has learned.\tThe lack of participation by", 
        "", 
        "Bellingham, Washington, is usually thought of as a picturesque Northwest harbor town, but it was the setting of a huge anti-Sikh riot. Curtis Cronn / Flickr\tThe 1907 episode in a seaside timber town in Washington came to be known as the Bellingham Riots.", 
        "BY Sapreet Kaur\tOn Aug. 5, 2012, a neo-Nazi gunman opened fire on his fellow Americans at a gurdwara (Sikh house of worship) in Oak Creek, Wisc., killing six people and permanently injuring several more, including a law enforcement officer. As Sikhs mark", 
        "IVAN MORENO AP\tMembers of the Sikh Society of Madison hold a candlelight vigil outside the society's temple in Middleton on Aug. 7, 2012. The prayer service followed a shooting at the Sikh Temple of Wisconsin in Oak Creek that claimed the lives of six", 
        "Law enforcement officials investigate an explosion at the Dar Al-Farooq Islamic Center in Bloomington, Minn., on Saturday, Aug. 5, 2017. Bloomington police Chief Jeff Potts said Saturday that investigators are trying to determine the cause of the blast.", 
        "Law enforcement officials investigate an explosion at the Dar Al-Farooq Islamic Center in Bloomington, Minn., on Saturday, Aug. 5, 2017. Bloomington police Chief Jeff Potts said Saturday that investigators are trying to determine the cause of the blast.", 
        "By Rob Port on Aug 5, 2017 at 3:23 pm\tparking lot of a Fargo Walmart made national headlines, the usual cast of political opportunists have parachuted in to make political hay.\tNorth Dakota is one of just a few states without hate crime legislation on the", 
        "Six people were killed when a white supremacist attacked the Gurdwara or Sikh Temple of Wisconsin five years ago. VOA\tAug 06, 2017: Over the past year, minorities across the United States have increased their outreach to the public and efforts to make", 
        "POV documentary \"Two Towns of Jasper\" follows a community's reaction to the 1998 murder of James Byrd, Jr.\tBroken trust, stereotypes, a historically unjust justice system and internal prejudices: These are just some of the issues that both captivated and", 
        "Zahra Billoo, of the Council on American-Islamic Relations, says she posted a threatening letter received by a San Jose mosque on four Facebook accounts. She was baffled when the company removed it from two and left it up on two others.\tFrancie Latour was", 
        "By alexander simon\tHome Њй Posts Њй International Њй 'Hate crime or act of terror?' FBI probes IED bombing attack on Minnesota mosque дуо RT America\tThe FBI believes that an Improvised Explosive Device (IED) caused the blast that rocked the Dar Al-Farooq", 
        "The FBI believes that an Improvised Explosive Device (IED) caused the blast that rocked the Dar Al-Farooq Islamic Center in Bloomington, Minnesota. While the explosion caused some damage, no one was killed in the attack that occurred during Saturday", 
        "On the morning of Aug. 5, 2012, a neo-Nazi gunman murdered six Americans who gathered to pray at a gurdwara (Sikh house of worship) in Oak Creek, Wisconsin. The Oak Creek massacre ranks among the most lethal hate crimes in the modern history of our", 
        "THE 1907 EPISODE in a seaside timber town in Washington came to be known as the Bellingham Riots. Really, though, there were no riots. There was a pogrom.\tAt the time, the US was suffering through deep economic distress, a panic-filled recession that had", 
        "No one was injured in the explosion, though the mosque sustained fire and smoke damage. (Source: WCCO/CNN)\tBLOOMINGTON, MN (WCCO/CNN) дус Members of a Minnesota Islamic center feel targeted after an explosion Saturday, caused by what federal authorities", 
        "Law enforcement officials investigate an explosion at the Dar Al-Farooq Islamic Center in Bloomington, Minn., on Saturday, Aug. 5, 2017. Bloomington police Chief Jeff Potts said Saturday that investigators are trying to determine the cause of the blast.", 
        "By JEFF BAENEN AP\tPeople gather outside of the Dar Al Farooq Islamic Center in Bloomington, Minn., on Sunday, Aug. 6, 2017, where an explosion damaged a room and shattered windows as worshippers prepared for morning prayers early Saturday. (Courtney", 
        "Federal officials have not classified the incident as a hate crime or act of terrorism (1:44). WCCO Sunday Morning дус Aug. 6, 2017", 
        "By JEFF BAENEN AP\tMohamed Omar, left, the executive director of the Dar Al Farooq Center Islamic Center leads afternoon prayers outside the police tape surrounding the center Saturday Aug. 5, 2017 in Bloomington, Minn. Bloomington Police and federal", 
        "", 
        "Travel advisories warn you to carefully consider visiting certain places. Reasons typically range from severe weather to government instability, from civil war to terrorism.\tThe US State Department issues such advisories on a regular basis. Earlier this", 
        "Law enforcement officials investigate an explosion at the Dar Al-Farooq Islamic Center in Bloomington, Minn., on Saturday, Aug. 5, 2017. Bloomington police Chief Jeff Potts said Saturday that investigators are trying to determine the cause of the blast.", 
        "Karina Brown thought she was in for a fun night.\tOn March 18, Brown and her childhood friend went to see Bon Jovi at the Nationwide Arena in Columbus. They were celebrating her 45th birthday. Toward the end of the show, another concert-goer turned to her", 
        "By Guest contributor\tLast week, Randy Gamel-Medler, an Oklahoma gay man, filed a federal equal protection lawsuit in the US District Court for the Western District of Oklahoma against nine defendants from Blaine County, Oklahoma, including Mayor of", 
        "The Federal Bureau of Investigations (#FBI) is hunting for suspects who could have been responsible for an explosion at a Minnesota mosque. At the time of the bombing, Muslim faithful had assembled for morning prayers. Investigators are probing whether", 
        "(Reuters) - Minnesota's governor called the bombing of a mosque outside Minneapolis the previous day \"an act of terrorism\" during a visit to the site on Sunday.\tPolice in Bloomington, Minnesota, were called on Saturday at 5:05 am local time about an", 
        "BLOOMINGTON, Minn. дуо Gov. Mark Dayton condemned Sunday the bombing of a suburban Minneapolis mosque as \"an act of terrorism.\"\tHe, Lt. Gov. Tina Smith and other elected officials toured the site and met with local leaders of the Dar Al-Farooq Islamic", 
        "By alexander simon\tHome Њй Posts Њй Entertiment Њй This woman went to a Bon Jovi concert. An act of hatred made her leave.\tKarina Brown, a college administrator from Columbus, was celebrating her 45th birthday when a woman told her she didn't думbelong in", 
        "LAFAYETTE (KRON)дус The owner of a hair salon in Lafayette feels threatened after his shop was vandalized.\tHairdresser, Clark Russell, spent much of his Sunday vacuuming up shards of glass after someone threw a rock through his salon's door.\tRusell said", 
        "Above: Baltimore Brew has joined with the non-profit news organization ProPublica, as well as organizations across the country, to compile reports of hate and verify them in order to create a national database to clarify the issue and better report what", 
        "By William W. Savage III, Editor in Chief -\tA civil rights lawsuit filed in US District Court on Thursday contains some of the most heinous allegations of hate crimes one could imagine.\tAdditionally, because the lawsuit claims that Blaine County Sheriff's", 
        "Also: the best kind of rejection letter for a 9-year-old, an unfortunate pup needs a home and a bargain for an island.\tBy Cody Fenwick (Patch National Staff) - Updated August 7, 2017 2:07 am ET\tGood morning! It's Monday, and we hope you had a restful", 
        "Using symbols or salutes linked to Hitler and Nazis is a very serious offense in Germany дусtwo Chinese tourists learned that the hard way.\tTwo tourists in Berlin, Germany, landed in hot water after they were caught taking pictures in front of the", 
        "By Conor Gaffey On 8/7/17 at 7:48 AM\tMuslim groups in the United States are offering rewards of $10,000 for information on the individual(s) responsible for the bombing of a mosque in Minnesota on Saturday.\tThere was an explosion at the Dar Al-Farooq", 
        "By Angie Wieck Today at 8:01 am\tDespite what Rob Port said in his Aug. 6 column, there are at least two good reasons\tfor North Dakota to enact hate crime legislation: to prevent repetitions and break up hate groups.\tThe person who blows up one mosque is", 
        "By Jeff Baenen AP\tDebris is scattered around a room inside the Dar Al Farooq Islamic Center in Bloomington, Minnesota, after an explosion damaged the room and shattered windows as worshipers prepared for morning prayers.\tCourtney Pedroza/Star Tribune via", 
        "", 
        "German civil rights activist Taner Aksoy argues that anti-Muslim sentiment has had a long history in Germany but is becoming increasingly violent because of external factors and the country's far-right xenophobic campaigns.\tThe far-right in Germany has", 
        "Using symbols or salutes linked to Hitler and Nazis is a very serious offense in Germany дусtwo Chinese tourists learned that the hard way.\tTwo tourists in Berlin, Germany, landed in hot water after they were caught taking pictures in front of the", 
        "By Brian Lambert | 08/07/17\tKaren Brulliard and Amy Wang of The Washington Post report: думMinnesota Gov. Mark Dayton denounced an explosion that rocked a Minneapolis-area mosque during morning prayers Saturday as a 'wretched' hate crime and act of", 
        "By Conor Gaffey On 8/7/17 at 7:48 AM\tMuslim groups in the United States are offering rewards of $10,000 for information on the individual(s) responsible for the bombing of a mosque in Minnesota on Saturday.\tThere was an explosion at the Dar Al-Farooq", 
        "By Angie Wieck Today at 8:01 am\tDespite what Rob Port said in his Aug. 6 column, there are at least two good reasons\tfor North Dakota to enact hate crime legislation: to prevent repetitions and break up hate groups.\tThe person who blows up one mosque is", 
        "By Jeff Baenen AP\tDebris is scattered around a room inside the Dar Al Farooq Islamic Center in Bloomington, Minnesota, after an explosion damaged the room and shattered windows as worshipers prepared for morning prayers.\tCourtney Pedroza/Star Tribune via", 
        "By JONAH ENGEL BROMWICH AUG. 7, 2017\tGov. Mark Dayton of Minnesota at the Dar Al Farooq Islamic Center in Bloomington, Minn., on Sunday, a day after an explosion damaged the building in what the governor called an думact of terrorism.дуќ Courtney", 
        "", 
        "German civil rights activist Taner Aksoy argues that anti-Muslim sentiment has had a long history in Germany but is becoming increasingly violent because of external factors and the country's far-right xenophobic campaigns.\tThe far-right in Germany has", 
        "OKLAHOMA CITYдуо Randy Gamel-Medler, a gay man, filed a federal equal protection lawsuit in the US District Court for the Western District of Oklahoma against nine defendants from Blaine County, Oklahoma, including Hitchcock Mayor Rick Edsall, Blaine", 
        "(CNN) - Minnesota's governor declared that the explosion at a mosque outside Minneapolis over the weekend was \"an act of terrorism.\"\tAn improvised explosive device caused an explosion at the Dar Al-Farooq Islamic Center in Bloomington, the FBI said.\tGov.", 
        "The FBI has not yet ruled the bombing at the Dar Al-Farooq Islamic Center a hate crime, but confirms that the explosion was the result of a думdestructive device in violation of federal law.дуќ\tDar Al-Farooq Islamic Center in Bloomington, Minnesota, on", 
        "by Thomas Forester\tWEST PALM BEACH, Fla. (CBS12) дуо A motive behind Sunday morning's shooting outside of a Lake Worth restaurant may have been a hate crime.\tA witness told deputies that 48-year-old Nelson Mena confronted a group of men, including the", 
        "While the FBI continues to search for a perpetrator who threw an improvised explosive device through a window of an imam's office at the Dar Al Farooq mosque in Bloomington, Minnesota, the Whitehouse has yet to comment. Is there a double standard when it", 
        "AP | 0 comments\tWOODBRIDGE, NJ (AP) дуо Police are investigating after a New Jersey man reported he was punched in the face and his car's windows were smashed by a group of motorcyclists in a racially-motivated attack.\tPolice say the family was traveling", 
        "Minneapolis, MN дуо Meredith Aby-Keirstead of the Twin Cities-based Anti-War Committee condemned the August 5 bombing of the Dar Al-Farooq Islamic Center, stating, думIt is important for all people of conscience to stand with our Muslim neighbors against", 
        "A man charged with fatally shooting another man in downtown Lake Worth this weekend after allegedly saying думI hate you (expletive) gays, I'm going to kill you all here,дуќ could have charges enhanced to a hate crime under Florida law, according to a", 
        "by Chuck Weber\tWEST PALM BEACH, Fla. (CBS12) дуо A 22-year old man-- shot and killed defending friends outside a Lake Worth restaurant.\tThe arrest report, obtained by CBS12, indicates the men in the group may have been targeted for being gay.\tдумNow we", 
        "On Aug. 6, two days after a pair of hate crimes shook Colorado Springs, hundreds of people came together to denounce bigotry and affirm that this community values multiculturalism, tolerance and peace. The rally, organized by the National Association for", 
        "", 
        "", 
        "When they were about to leave, Mena allegedly said \"If we were in my country, I'd kill all of you like rats\". \"If we were in my country I'd kill all of you like rats\", he said, according to another. On Monday, a judge ordered him held without bail at the", 
        "By Alex Bollinger Њ‡\tWitnesses say that there were other groups of diners outside the restaurant, which had just closed. Nelson Hernandez Mena, 48, was in one of the other groups of people. He would later tell investigators that he drank between 15 and 20", 
        "Governor Mark Dayton has condemned as terrorism Saturday's attack on the Dar Al-Farooq Islamic Center in Bloomington, Minnesota. The explosive device was thrown through the mosque office's window around 5 am as people were gathering for morning prayers.", 
        "A Florida man was shot and killed early Sunday after defending his gay friends from a homicidal homophobe.\tJuan Javier Cruz (above) was leaving a restaurant around 1 am with some friends, some of whom are gay, when they were confronted by a man who began", 
        "On Saturday an \"improvised explosive device\" was detonated in a Minneapolis-area mosque in what Minnesota Governor Mark Dayton denounced as a \"dastardly, cowardly\" hate crime.\tIt's just the latest case in an ever-quickening escalation of anti-Islamic", 
        "by Thomas Forester\tCBS12 reporter Thomas Forester talks to Lake Worth residents about the shooting death of Juan Cruz. (WPEC)\tLAKE WORTH, Fla. (CBS12) дуо Many people in Lake Worth would agree the city is arguably one of the most accommodating cities in", 
        "AP\tOn Saturday an \"improvised explosive device\" was detonated in a Minneapolis-area mosque in what Minnesota Governor Mark Dayton denounced as a \"dastardly, cowardly\" hate crime.\tIt's just the latest case in an ever-quickening escalation of anti-Islamic", 
        "\"Hold your horses and count to ten and the president will do what he deems fit.\"\tDeputy assistant to President Trump, Sebastian Gorka, talks with people in the Treaty Room in the Eisenhower Executive Office Building on the White House complex in", 
        "A 22-year-old Florida man is being hailed a hero after he was fatally shot early Sunday morning while allegedly coming to the defense of friends and relatives who were being mistreated because they are gay, PEOPLE confirms.\tA 48-year-old man is behind", 
        "The Southern Poverty Law Center documented more than 1,000 hate incidents and hate crimes during 10 days in early November following the presidential election. The hate continues and, in fact, seems to be escalating worldwide.\tTo examine and promote", 
        "by Sarah A. Harvard\tThe FBI and the Bureau of Alcohol, Tobacco, Firearms and Explosives are investigating a bombing that took place on Saturday at the Dar Al-Farooq Islamic Center in suburban Minneapolis while worshippers were performing their morning", 
        "LAKE WORTH (CBSMiami) дусThe death of a 22-year-old in Lake Worth has been deemed a possible hate crime.\tDeputies say Juan Cruz was shot and killed outside the Las Flores restaurant on Sunday, according to CBS12.\tHis cousin, Pedro Cruz, now says when he", 
        "by Caitlin Yilek | Aug 8, 2017, 2:47 PM\tPresident Trump does not yet plan to comment on a Minnesota mosque bombing because the White House isn't sure that initial reports of who is responsible are true, national security aide Sebastian Gorka said Tuesday.", 
        "BY Catherina Gioino Molly Crane-newman Rocco Parascandola\tEggs hurled in Farid el-Baghdadi's direction hit him on his right arm and in his upper body.\tA food vendor in Queens was pelted with eggs by an attacker who left behind an anti-Muslim hate message,", 
        "A German-Israeli artist who accuses Twitter of failing to delete hate speech tweets has taken matters into his own handsдуоby stencilling the offending messages on the road in front of the company's Hamburg headquarters.\tA post on video-sharing site", 
        "On MSNBC on Tuesday, White House aide Sebastian Gorka said that President Donald Trump's administration would only comment on the recent bombing of a mosque in Minneapolis when there is думsome kind of finalized investigation.дуќ\tAccording to Gorka,", 
        "SEATTLE, Wash. дус Marcus Choi was walking his dogs in the Bitter Lake neighborhood in North Seattle when he heard a man shouting behind him. думI turn around and he's right up in my space with his forehead on mine,дуќ Choi said, recalling the incident.", 
        "By Jaxon Van Derbeken\tAre you surprised a grand jury has convened regarding alleged Russian interference in the 2016 elections?\tA San Francisco judge on Tuesday ordered a mental evaluation of a man facing hate crime assault and threats charges but who is", 
        "By Tammy Bruce - The Washington Times - Tuesday, August 8, 2017\tImagine this: Someone goes through massive body-altering, gender-changing surgery, changes her life and risks the rejection of her family, all in order to be her genuine self.\tAgree or", 
        "думIf we don't address these issues, then these incidents multiply and become bigger and bigger.дуќ\tBy Rebecca Nuttall @PghReporter\tOn Nov. 22, a few weeks after the presidential election, an Indian man named Ankur Mehta was allegedly attacked at a Red", 
        "By Brian Lambert | 05:51 am\tFor The Huffington Post, Marina Fang reports: думSebastian Gorka, a White House national security adviser, defended President Donald Trump's silence on an explosion at a Minnesota mosque by suggesting it could have been a fake", 
        "By Tom Porter On 8/9/17 at 7:40 AM\tMuslim leaders have condemned a White House official who said that a suspected terror attack on a Minnesota mosque may have been a false flag attack carried out by leftists.\tSebastian Gorka, a deputy assistant to", 
        "By Rachel Hardy Aug 09, 2017\tMinnesota Gov. Mark Dayton (D) on Sunday visited the center and called the bombing \"an act of terrorism\". Local police confirmed that a destructive device had caused the explosion.\t\"What a bad, dastardly, cowardly awful act", 
        "by Sharon Huff | August 09, 2017 | 16:06\tPolice sources told Kashmir Reader that army's 44 RR patrolling party was sacked upon by militants at Drabgam. \"However, two managed to escape from the site, but one of them was injured\", said a police spokesman.", 
        "The first time these 16 students experienced racism? When they were bullied by classmates inspired by Donald Trump's words. думEverybody in the school was super nice дуо until President Trump won.дуќ\tAlthough the 14-year-old Mexican-American girl had", 
        "By MICHAEL GRACZYK AP\tA man on death row for the notorious slaying nearly 20 years ago of a black man chained to the back of a pickup truck and dragged along a bumpy rural East Texas road will get his claim of innocence and poor legal representation", 
        "(JTA) дуо French Jewish leaders seized on a suspected terrorist attack against police officers to again criticize authorities for not labeling the murder of a Jewish woman as a hate crime.\tOn Wednesday, the CRIF umbrella group of French Jews posted a", 
        "by Tarina Hargrays\tLocal violence-prevention activist Tio Hardiman is running for Illinois governor for the second time since his run in 2014.\tHardiman's platform consists of creating new jobs; supporting legal gun owners; ending political corruption; and", 
        "A new alliance of businesses, organizations and individuals hopes to rally attention and response to the rising incidents of hate-based crimes and incidents in Indiana.\tThe Central Indiana Alliance Against Hate (CIAAH) is a project initiated by the Fair", 
        "By Crime and Justice News | 11 hours ago\tNearly every state imposes additional criminal penalties when a perpetrator assaults or kills a police officer. Should such attackers also be convicted of hate crimes? Many states think they should, reports", 
        "by Serena Dai Aug 9, 2017, 11:10am EDT\tOwner Farid el-Baghdadi of Farid Grill halal food truck was talking to a customer on Monday night when somebody threw eggs at him, according to the Daily News. The eggs arrived with notes attached by rubber bands", 
        "", 
        "Deputy assistant to President Trump Sebastian Gorka suggested that the president has not yet commented on the bombing of a Minnesota mosque because it may be a fake hate crime.", 
        "In the photo above, a member of the FBI's Evidence Response Team surveys damage at the Dar Al-Farooq Islamic Center in Bloomington after a Saturday firebombing that Gov. Mark Dayton has labeled думa hate crime.дуќ\tThe incident happened about about 5 am", 
        "By Tom Porter On 8/9/17 at 12:47 PM\tPresident Donald Trump has been quick to condemn Islamic terrorist attacks in Europe, and has used them as evidence to justify his hardline anti-immigration policies, yet he has remained silent about a suspected", 
        "", 
        "by Andrew Joyce\tOn Monday, White House deputy adviser Sebastian Gorka implied that an attempted bombing at a Minnesota mosque may have been a false flag operation by думthe left.дуќ\tдумThere's a great rule: All initial reports are false.дуќ Gorka said in", 
        "", 
        "\"We've had a series of crimes committed, alleged hate crimes by rivaling individuals in the last six months that turned out to actually be propagated by the left, so let's wait and see\".\tHe added, in reference to the bombing at the Dar al-Farooq Islamic", 
        "Erick Pastuizaca allegedly punched a prison guard in the face at Rikers Island while in jail for hate crime assault charges. AP PhotoSeth Wenig, File\tBy Paul Frangipane\tA prisoner who allegedly assaulted a guard while in jail on hate crime charges for a", 
        "AP | 0 comments\tWOODBRIDGE, NJ (AP) дуо Authorities say an attack on a family's vans by motorcyclists was not racially-motivated as originally reported.\tPolice in Woodbridge said Wednesday that they have no suspects after a New Jersey man reported he was", 
        "", 
        "On the first day of class, on one of the country's most diverse college campuses, the assignment came as something of a shock.\tWrite to a former neo-Nazi who had firebombed a synagogue, the instructor told his students at George Mason University.\tNear the", 
        "\"Hate is becoming too prevalent in our society. It spreads on social media and infects our discourse. We must counter it with love and the values we hold so dear,\" Ellison said. (Photo: Center for American Progress/Flickr/cc)\tPresident Donald Trump's", 
        "On Saturday an \"improvised explosive device\" was detonated in a Minneapolis-area mosque in what Minnesota Governor Mark Dayton denounced as a \"dastardly, cowardly\" hate crime.\tIt's just the latest case in an ever-quickening escalation of anti-Islamic", 
        "by CS Hagen | Contact | News | August 9th, 2017\tVALLEY CITY дус The hate Matthew Kinslow experienced while growing up in North Dakota reads like someone's long and horrid to-do list.\tHalf Korean, half German, Kinslow was smaller than other children his", 
        "Granada, Spain, Aug 10, 2017 / 12:37 am (CNA/EWTN News).- A Spanish state prosecutor has dismissed a 'hate crime' complaint against the Archbishop of Granada after an LGBT activist group claimed he had preached hate against transgender people in a homily.", 
        "", 
        "By Jessica Pounds features@trcle.com\tThe Texas думPolice Protection Act,дуќ which will increase the penalties for crimes targeting police officers and judges, and adding them to the list of people protected under hate crimes goes into effect Sept. 1.\tA", 
        "A food cart owner in Astoria was hit with eggs on Monday, which contained a note with anti-Muslim rhetoric.\tBy Angela Matua\tPolice are looking for a man who threw eggs and an anti-Muslim note at an Astoria food truck owner on Monday.\tAccording to police,", 
        "", 
        "The perpetrators seek to intimidate the tens of thousands of Somali Muslims who attend mosques in the Minneapolis area.\tBy Sahar F. Aziz and Khaled A. Beydoun\tWhen a church is bombed in the Middle East, American politicians compete to condemn the act as", 
        "In the wake of the 2016 presidential election, the US has experienced an increase in media reported incidents of discrimination and hate crimes. The Southern Poverty Law Center reported 867 hate incidents in the first 10 days following Donald Trump's", 
        "by Virginia Hale10 Aug 20170\tPolice 'Hate Crime Ambassador' Sergeant Peter Allan has praised a complaint about toilet signs depicting a woman and baby, asserting that the 'sexist' imagery думshould not be happening in 2017дуќ.\tThe 'Trans Equality", 
        "The NYPD's Hate Crimes Task Force is investigating a series of egging attacks on a Muslim street vendor in Astoria.\tPublished reports say Farid el-Baghdadi, 56, who runs a food cart on Steinway Street near 25th Avenue, was hit with eggs just after", 
        "LONDON (Reuters) - Hate crimes in Britain spiked in the aftermath of three attacks blamed on Islamist militants earlier this year but the number quickly dropped in the following days, police said on Thursday.\tFigures released by the National Police", 
        "LONDON, Aug 10 (Reuters) - Hate crimes in Britain spiked in the aftermath of three attacks blamed on Islamist militants earlier this year but the number quickly dropped in the following days, police said on Thursday. Figures released by the National", 
        "The National Police Chiefs' Council said there was a 50% increase after the Manchester Arena attack in May.\tSoldiers join police officers at the Palace of Westminster, London.\tAs much as 50% more hate crime was reported by the British public in the week", 
        "Hate crime reports jumped sharply as Britain was hit by a spate of terrorist attacks earlier this year, new figures show.\tPolice registered increases in the incidents in the days immediately after the atrocities at Westminster, Manchester and London", 
        "A homeless 26-year-old man who attacked a man with a baseball bat at Alexandria's Potomac Yard shopping center this year was sentenced Thursday to three months in jail.\tJohn Michael Ready has served his jail time after pleading guilty last month to a", 
        "", 
        "On July 28, 2017, John Michael Ready, a 26-year old male with no fixed address, pleaded guilty to one misdemeanor count of simple assault in which he selected his victim based on the victim's race. The Alexandria General District Court sentenced him to 12", 
        "", 
        "Hate crime reports surged in the days immediately after three terror attacks in the UK this year, police data shows.\tThe National Police Chiefs Council (NPCC) registered \"brief increases\" in hate crime reports following attacks at Westminster, Manchester", 
        "When Harfateh Singh first heard about the July 25 murder of Simranjit Singh at a south Sacramento gas station, the former president of the Sikh Cultural Association at UC Davis thought immediately of the tragedies that already have struck his community.", 
        "A man sentenced in late July for a hate crime against an African-American man has already been released from jail in Alexandria.\tBy Emily Leayman (Patch Staff) - Updated August 10, 2017 5:10 pm ET\tALEXANDRIA, VAдуоA homeless man was sentenced for a hate", 
        "Each legislative session thousands of bills and amendments are introduced in the Pennsylvania Legislature. Only a fraction become law, and an even smaller portion receive wide media coverage.\tThese bills impact the lives of people living in Pennsylvania", 
        "PACIFIC, Mo. - A family is calling for a hate crime investigation after their home was destroyed in a house fire . Authorities have confirmed they are searching for three people. Eight people inside the home escaped. The family believes they were targeted", 
        "A New Yorker is preparing Muslim women to protect themselves against hate crimes. Rana Abdelhaid, of Queens, is founder of the International Muslim Women's Initiative for Self-Empowerment. She teaches women how to defend against shoving and other", 
        "By Jessica Pounds | CNHI News\tThe Texas думPolice Protection Act,дуќ which will increase the penalties for crimes targeting police officers and judges, and adding them to the list of people protected under hate crimes goes into effect Sept. 1.\tCLEBURNE,", 
        "", 
        "Hate crimes and verbal abuse soared after each of the terrorist attacks in the United Kingdom this year except the most recent, when a van was driven into Muslim worshippers outside Finsbury Park mosque in June, killing one man, police said (writes John", 
        "Advocates said the statistic дуо which doesn't include the Pulse nightclub shooting дуо \"should be a wake-up call.\"\tMore LGBT people have been killed in what advocacy groups categorize as hate-violence-related homicides so far in 2017 than in all of 2016,", 
        "By challenging policies that help open colleges' doors to more students, the White House is trying to rally the president's core supporters.\tBy The Editorial Board\tThe past 50 years of social progress have been tough to accept for those Americans who", 
        "", 
        "by Jack Montgomery11 Aug 20170\tA man who scrawled anti-white, racist abuse on his neighbour's door and threatened to kill a woman with a knife has escaped prison after the judge heard he was an думabsolute delightдуќ and his actions were думcertainly not", 
        "By Sydney Robinson -\tWe are just over halfway through the year of 2017, and already it has been discovered that more LGBT Americans have been murdered in hate-crime related attacks in this year than the entirety of 2016.\tAccording to data provided by the", 
        "Ben Sunderlin places a sign of support near the window that was damaged during Saturday morning's attack at the Dar Al Farooq Islamic Center in Bloomington, Minn., on Tuesday, Aug. 8, 2017. More than a thousand people attended a community-wide show of", 
        "", 
        "A new report says that more LGBTQ people have been killed in what advocacy groups called hate-violence-related homicides in the first eight months of 2017 than in all of 2016 in the United States.\tBuzzfeed News reports that as of August 2017 there have", 
        "by David Badash\tReports from the National Coalition of Anti-Violence Programs, examined by Buzzfeed, show there have already been more anti-LGBT hate-motivated homicides this year than in all of 2016.\tAccording to BuzzFeed News reporter Nidhi Prakash, not", 
        "By Chris Thomas\tIn the first eight months of the year, more LGBTQ people have been killed in the United States than in all of 2016. The shocking finding comes from the National Coalition of Anti-Violence, an advocacy group that keeps track of", 
        "As of this month, 33 LGBTQ people have been killed in homicides related to hate violence in 2017, according to the National Coalition of Anti-Violence Programs (NCAVP). By comparison, there were 28 similar homicides in all of 2016 дуо though this number", 
        "By Jim Shaw Today at 7:00 am\tThe push is on for hate crime legislation in North Dakota, to which I say...\t--It's long overdue. North Dakota is shamefully, but not surprisingly, one of only five state states without such laws. Meantime, North Dakota", 
        "By Jim Shaw Today at 7:00 am\tThe push is on for hate crime legislation in North Dakota, to which I say...\t--It's long overdue. North Dakota is shamefully, but not surprisingly, one of only five state states without such laws. Meantime, North Dakota", 
        "A new study out this week shows that there have already been more anti-LGBT hate motivated homicides this year than all of 2016.\tThe report and data comes from the National Coalition of Anti-Violence Programs. The data they present show there have already", 
        "By Robert Scott on 13 August 2017 Headlines\tWASHINGTON, Aug. 12 (Xinhua) дуо US Presidend Donald Trump condemned думall that hate stands forдуќ after the state of Virginia declared emergency on Satuday as a big white nationalist rally turned violent in", 
        "A new study out this week shows that there have already been more anti-LGBT hate motivated homicides this year than all of 2016.\tThe report comes from the National Coalition of Anti-Violence Programs. The data they present shows that in 2016 there were 28", 
        "Responding to chaos surrounding a white nationalist rally in Charlottesville, Va., both President Donald Trump and First Lady Melania Trump have condemned hate and violence.\t\"There is no place for this kind of violence in America,\" Trump said.\t\"No good", 
        "White supremacists clashing with anti-racism activists in Virginia has taken place in a city that has a history steeped in Civil War and civil rights, a place that profits greatly from people obsessed with landmarks and milestones that Charlottesville", 
        "Similar words have been used by leaders across the country following the horrifying events in Charlottesville today. Those words were intended to embrace the nation, with its many diversities and constituencies.\tBut we say, as a part of this community:", 
        "White women have always played a role in propping up white supremacy and toxic masculinity.\tBy Jenavieve Hatch\tOn the front lines of Friday night's думUnite The Rightдуќ rally in Charlottesville, Virgina, at the University of Virginia, angry white men", 
        "He refused to respond to reporters who asked him whether he would call the white supremacists in Charlottesville terrorists.\tPresident Donald Trump loves to sound tough. He likes his insults in the strongest, most direct and offensive terms. As a", 
        "By Amanda Milkovits\tRhode Island legislative leaders and activists widely condemned the думUnite the Rightдуќ rally of white supremacists in Charlottesville, Virginia, and the violence connected to it that left one woman dead and dozens injured.\tAs US", 
        "State police and National Guardsmen watched passively for hours as self-proclaimed Nazis engaged in street battles with counter-protesters. ProPublica reporter AC Thompson was on the scene and reports that the authorities turned the streets of the city", 
        "By consistently showing up in force to protest against hatred, the people of Charlottesville have ensured that the wannabe nazis cannot claim the mantle of the silent majority.\tThat was the chant among the white nationalists as they descended upon"
    ], 
    "Article Date": [
        "8/2/17 8:18", 
        "8/2/17 11:11", 
        "8/2/17 12:30", 
        "8/2/17 15:30", 
        "8/2/17 19:37", 
        "8/2/17 21:52", 
        "8/2/17 22:15", 
        "8/3/17 5:03", 
        "8/3/17 5:45", 
        "8/3/17 5:56", 
        "8/3/17 6:23", 
        "8/3/17 10:15", 
        "8/3/17 13:03", 
        "8/3/17 22:24", 
        "8/4/17 2:33", 
        "8/4/17 3:07", 
        "8/4/17 5:22", 
        "8/4/17 7:15", 
        "8/4/17 10:48", 
        "8/4/17 13:02", 
        "8/4/17 13:03", 
        "8/4/17 14:24", 
        "8/4/17 15:52", 
        "8/4/17 16:03", 
        "8/4/17 19:03", 
        "8/5/17 2:00", 
        "8/5/17 4:03", 
        "8/5/17 8:05", 
        "8/5/17 12:30", 
        "8/5/17 13:26", 
        "8/5/17 14:00", 
        "8/5/17 14:56", 
        "8/5/17 20:56", 
        "8/5/17 21:07", 
        "8/5/17 21:07", 
        "8/6/17 1:26", 
        "8/6/17 1:48", 
        "8/6/17 2:33", 
        "8/6/17 6:41", 
        "8/6/17 6:51", 
        "8/6/17 6:54", 
        "8/6/17 7:14", 
        "8/6/17 8:45", 
        "8/6/17 9:18", 
        "8/6/17 10:15", 
        "8/6/17 10:26", 
        "8/6/17 11:33", 
        "8/6/17 12:07", 
        "8/6/17 12:52", 
        "8/6/17 15:41", 
        "8/6/17 18:27", 
        "8/6/17 21:30", 
        "8/6/17 21:52", 
        "8/6/17 22:03", 
        "8/6/17 23:00", 
        "8/7/17 1:48", 
        "8/7/17 4:48", 
        "8/7/17 5:56", 
        "8/7/17 6:03", 
        "8/7/17 7:03", 
        "8/7/17 7:09", 
        "8/7/17 1:48", 
        "8/7/17 4:15", 
        "8/7/17 4:48", 
        "8/7/17 5:56", 
        "8/7/17 6:03", 
        "8/7/17 6:51", 
        "8/7/17 7:03", 
        "8/7/17 7:09", 
        "8/7/17 8:00", 
        "8/7/17 9:18", 
        "8/7/17 11:33", 
        "8/7/17 11:41", 
        "8/7/17 12:30", 
        "8/7/17 12:52", 
        "8/7/17 14:22", 
        "8/7/17 14:33", 
        "8/7/17 15:38", 
        "8/7/17 16:48", 
        "8/7/17 18:30", 
        "8/7/17 21:52", 
        "8/8/17 3:52", 
        "8/8/17 6:07", 
        "8/8/17 7:40", 
        "8/8/17 9:30", 
        "8/8/17 9:41", 
        "8/8/17 9:56", 
        "8/8/17 10:15", 
        "8/8/17 10:37", 
        "8/8/17 10:48", 
        "8/8/17 11:11", 
        "8/8/17 11:11", 
        "8/8/17 11:33", 
        "8/8/17 11:45", 
        "8/8/17 12:26", 
        "8/8/17 12:53", 
        "8/8/17 13:15", 
        "8/8/17 17:00", 
        "8/8/17 17:09", 
        "8/8/17 18:32", 
        "8/9/17 0:52", 
        "8/9/17 4:17", 
        "8/9/17 4:37", 
        "8/9/17 4:50", 
        "8/9/17 5:11", 
        "8/9/17 6:05", 
        "8/9/17 6:58", 
        "8/9/17 7:01", 
        "8/9/17 7:15", 
        "8/9/17 7:37", 
        "8/9/17 8:05", 
        "8/9/17 8:11", 
        "8/9/17 8:25", 
        "8/9/17 9:27", 
        "8/9/17 9:30", 
        "8/9/17 9:47", 
        "8/9/17 9:52", 
        "8/9/17 10:06", 
        "8/9/17 10:37", 
        "8/9/17 11:11", 
        "8/9/17 11:33", 
        "8/9/17 12:07", 
        "8/9/17 13:26", 
        "8/9/17 14:18", 
        "8/9/17 14:33", 
        "8/9/17 15:07", 
        "8/9/17 17:11", 
        "8/9/17 23:33", 
        "8/10/17 4:26", 
        "8/10/17 5:06", 
        "8/10/17 5:56", 
        "8/10/17 6:41", 
        "8/10/17 8:16", 
        "8/10/17 9:07", 
        "8/10/17 9:41", 
        "8/10/17 9:49", 
        "8/10/17 11:00", 
        "8/10/17 11:00", 
        "8/10/17 11:00", 
        "8/10/17 11:11", 
        "8/10/17 11:45", 
        "8/10/17 11:54", 
        "8/10/17 11:56", 
        "8/10/17 12:00", 
        "8/10/17 13:15", 
        "8/10/17 13:15", 
        "8/10/17 13:37", 
        "8/10/17 14:00", 
        "8/10/17 14:33", 
        "8/10/17 14:56", 
        "8/10/17 16:26", 
        "8/10/17 16:35", 
        "8/10/17 17:00", 
        "8/10/17 17:33", 
        "8/11/17 1:03", 
        "8/11/17 6:21", 
        "8/11/17 6:41", 
        "8/11/17 8:33", 
        "8/11/17 10:03", 
        "8/11/17 10:26", 
        "8/11/17 10:37", 
        "8/11/17 11:45", 
        "8/11/17 12:41", 
        "8/11/17 13:37", 
        "8/12/17 5:06", 
        "8/12/17 5:06", 
        "8/12/17 9:41", 
        "8/12/17 12:30", 
        "8/12/17 13:03", 
        "8/12/17 14:45", 
        "8/12/17 15:18", 
        "8/12/17 16:02", 
        "8/12/17 17:43", 
        "8/12/17 18:16", 
        "8/12/17 19:37", 
        "8/12/17 20:00", 
        "8/12/17 20:46"
    ], 
    "Keywords": [
        "city constitution deli disorderly employees gourmet james maine police portland sisters taylor video yelling city constitution deli disorderly employees gourmet james maine police portland sisters taylor video yelling city constitution deli disorderly employees gourmet james maine police portland sisters taylor video yelling", 
        "cumberland deli derogatory gourmet hate incident jail james jesse maine police portland restaurant taylor", 
        "app arab blurring blurs bullying crimes director egypt exact global hate jack lgbtq locations market rivel russia saudi app arab blurring blurs bullying crimes director egypt exact global hate jack lgbtq locations market rivel russia saudi", 
        "", 
        "act creek crime crimes florida gurdwara hate justice miami oak policymakers saini sikh statistics act creek crime crimes florida gurdwara hate justice miami oak policymakers saini sikh statistics act creek crime crimes florida gurdwara hate justice miami oak policymakers saini sikh statistics", 
        "", 
        "", 
        "advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel advancement advisory caution cnn color colored dredd gaines india kuchibhotla missouri naacp national people slaveholding srinivas travel", 
        "amendment bachmann blasphemy church congress crimes fascists first hate islamic michele minneapolis rino separation sharia speech", 
        "album ban2oozle bandoozle boxx carrying club dance jipsta music pandora rupaul songs video willam album ban2oozle bandoozle boxx carrying club dance jipsta music pandora rupaul songs video willam", 
        "abdullahi ann arbor fargo hate hukun miller mpr north_dakota rain somalia speech united abdullahi ann arbor fargo hate hukun miller mpr north_dakota rain somalia speech united abdullahi ann arbor fargo hate hukun miller mpr north_dakota rain somalia speech united abdullahi ann arbor fargo hate hukun miller mpr north_dakota rain somalia speech united", 
        "africa caucasians crow discrimination gary implored jim missouri muslim naacp racially racist romine senate warning africa caucasians crow discrimination gary implored jim missouri muslim naacp racially racist romine senate warning africa caucasians crow discrimination gary implored jim missouri muslim naacp racially racist romine senate warning africa caucasians crow discrimination gary implored jim missouri muslim naacp racially racist romine senate warning", 
        "american angeles assaulted bakersfield balmeet california creek dastaar dastaars gurdwara hate nazi oak sikh sikhs american angeles assaulted bakersfield balmeet california creek dastaar dastaars gurdwara hate nazi oak sikh sikhs", 
        "creek file kaleka michaelis milwaukee oak saini scaffidi shot sikh sikhs singh temple wisconsin creek file kaleka michaelis milwaukee oak saini scaffidi shot sikh sikhs singh temple wisconsin creek file kaleka michaelis milwaukee oak saini scaffidi shot sikh sikhs singh temple wisconsin", 
        "advisory africa american black brown city discrimination drive ferguson kansas missouri missourians naacp race racial star state travel advisory africa american black brown city discrimination drive ferguson kansas missouri missourians naacp race racial star state travel advisory africa american black brown city discrimination drive ferguson kansas missouri missourians naacp race racial star state travel", 
        "american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin american creek gurdwara hate india kaleka oak palmeet prabhjot prakash ravinder sikh singh temple united wisconsin", 
        "alt antifa berkeley charlottesville counterprotesters crimes hate lee nationalist park protest rally report suspect turano unite united virginia", 
        "american bellingham bhullar crimes hate immigrants india khalsa mukker muslim nanak riot sikh sikhs singh turban washington american bellingham bhullar crimes hate immigrants india khalsa mukker muslim nanak riot sikh sikhs singh turban washington american bellingham bhullar crimes hate immigrants india khalsa mukker muslim nanak riot sikh sikhs singh turban washington american bellingham bhullar crimes hate immigrants india khalsa mukker muslim nanak riot sikh sikhs singh turban washington", 
        "", 
        "2vaj1by accused attack attorney brian car davidson deputy district hood leineweber oregonian oregonlive portland probation racist salazar tirade", 
        "affirmative american biases conditioning discredits implicit justice magnanimous mexico minorities privilege taught viscerally affirmative american biases conditioning discredits implicit justice magnanimous mexico minorities privilege taught viscerally affirmative american biases conditioning discredits implicit justice magnanimous mexico minorities privilege taught viscerally", 
        "court crime criminal daily epithets faggot hate island jones men stapleton staten tapharia transgender woman yaqwa york", 
        "agencies beyer blasher crime crimes database enforcement fbi federal hate information justice national propublica", 
        "", 
        "bellingham bhullar cronn flickr hate immigrants india khalsa mukker nanak northwest sikh sikhs singh turban washington bellingham bhullar cronn flickr hate immigrants india khalsa mukker nanak northwest sikh sikhs singh turban washington bellingham bhullar cronn flickr hate immigrants india khalsa mukker nanak northwest sikh sikhs singh turban washington", 
        "american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc american creek gurdwara guru hate house muslim nazi oak ragheads religion sikh sikhs towelheads turban wisc", 
        "creek kaleka madison michaelis milwaukee oak pardeep shot sikh society temple wisconsin worshipers creek kaleka madison michaelis milwaukee oak pardeep shot sikh society temple wisconsin worshipers", 
        "bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion explosive farooq fbi islamic jeff minneapolis minnesota mosque muslim potts worshipper", 
        "abdalrahman blast bloomington chief dar explosion farooq fbi islamic jeff minnesota mosque star tribune worshipper abdalrahman blast bloomington chief dar explosion farooq fbi islamic jeff minnesota mosque star tribune worshipper abdalrahman blast bloomington chief dar explosion farooq fbi islamic jeff minnesota mosque star tribune worshipper abdalrahman blast bloomington chief dar explosion farooq fbi islamic jeff minnesota mosque star tribune worshipper abdalrahman blast bloomington chief dar explosion farooq fbi islamic jeff minnesota mosque star tribune worshipper", 
        "crime crimes criminalizes fargo hate james law legislation north_dakota nyu opportunists parachuted politicize professor proponents school time walmart crime crimes criminalizes fargo hate james law legislation north_dakota nyu opportunists parachuted politicize professor proponents school time walmart", 
        "creek gurdwara kaleka oak shooting sikh sikhs supremacist supremacy temple voa white wisconsin creek gurdwara kaleka oak shooting sikh sikhs supremacist supremacy temple voa white wisconsin", 
        "american byrd documentary dow filmed james jasper murder nagan portrait pov texas town towns two american byrd documentary dow filmed james jasper murder nagan portrait pov texas town towns two american byrd documentary dow filmed james jasper murder nagan portrait pov texas town towns two american byrd documentary dow filmed james jasper murder nagan portrait pov texas town towns two american byrd documentary dow filmed james jasper murder nagan portrait pov texas town towns two american byrd documentary dow filmed james jasper murder nagan portrait pov texas town towns two american byrd documentary dow filmed james jasper murder nagan portrait pov texas town towns two american byrd documentary dow filmed james jasper murder nagan portrait pov texas town towns two", 
        "american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg american billoo black bulzone censoring content facebook hate islamic jose latour posts relations speech zahra zuckerberg", 
        "american attack blast bloomington dar device explosion explosive farooq fbi hate ied islamic minnesota mosque american attack blast bloomington dar device explosion explosive farooq fbi hate ied islamic minnesota mosque american attack blast bloomington dar device explosion explosive farooq fbi hate ied islamic minnesota mosque", 
        "attack blast bloomington dar device explosion explosive farooq fbi ied imam improvised investigation islamic minnesota attack blast bloomington dar device explosion explosive farooq fbi ied imam improvised investigation islamic minnesota attack blast bloomington dar device explosion explosive farooq fbi ied imam improvised investigation islamic minnesota attack blast bloomington dar device explosion explosive farooq fbi ied imam improvised investigation islamic minnesota attack blast bloomington dar device explosion explosive farooq fbi ied imam improvised investigation islamic minnesota attack blast bloomington dar device explosion explosive farooq fbi ied imam improvised investigation islamic minnesota", 
        "american army asia bias bullying creek hate interfaith nanak nazi oak pose religion sikh sikhs virginia wisconsin", 
        "american bellingham crimes hate india kaur mukker page saini sikh sikhs singh skinhead turban washington", 
        "bloomington cnn dar explosion explosive farooq hassan hate islamic members minnesota mosque muslim wcco worshippers", 
        "bloomington chief dar explosion farooq fbi investigators islamic jeff minneapolis minnesota mosque muslim potts worshipper bloomington chief dar explosion farooq fbi investigators islamic jeff minneapolis minnesota mosque muslim potts worshipper", 
        "bloomington center dar explosion farooq islamic minneapolis minnesota mosque mosques muslim omar pedroza star tribune worshippers bloomington center dar explosion farooq islamic minneapolis minnesota mosque mosques muslim omar pedroza star tribune worshippers bloomington center dar explosion farooq islamic minneapolis minnesota mosque mosques muslim omar pedroza star tribune worshippers", 
        "bloomington classified crime explosion fbi hate incident islamic morning terror wcco", 
        "bloomington center dar explosion farooq islamic minneapolis minnesota mosque mosques omar police star tribune", 
        "", 
        "advisories advisory africa bill chapel color conference discrimination greitens missouri naacp plaintiff senate somalia state", 
        "bloomington bomb dar dayton explosion farooq islamic latest minneapolis minnesota mosque star tribune", 
        "arena bon brown columbus discrimination documenting facebook glickhouse hate hatecrimes japan jovi nationwide propublica racism arena bon brown columbus discrimination documenting facebook glickhouse hate hatecrimes japan jovi nationwide propublica racism arena bon brown columbus discrimination documenting facebook glickhouse hate hatecrimes japan jovi nationwide propublica racism arena bon brown columbus discrimination documenting facebook glickhouse hate hatecrimes japan jovi nationwide propublica racism arena bon brown columbus discrimination documenting facebook glickhouse hate hatecrimes japan jovi nationwide propublica racism", 
        "africa american blaine district edsall gamel gay hammons hate hitchcock lgbtq mayor medler oklahoma", 
        "attack blast bloomington bureau explosion fbi federal hate homeland_security investigations minnesota mosque muslim police thornton", 
        "blast bloomington bomb bureau dar dayton farooq government imam investigation mark minneapolis minnesota mosque omar terror", 
        "bloomington bomb dar dayton ellison farooq islamic minneapolis minnesota mosque muslim smith somalia winstead", 
        "bon brown columbus concert discrimination documenting enquirer entertiment hate jovi karina posts propublica bon brown columbus concert discrimination documenting enquirer entertiment hate jovi karina posts propublica bon brown columbus concert discrimination documenting enquirer entertiment hate jovi karina posts propublica", 
        "clark gofundme hairdresser kron lafayette rusell russell salon shards targeted vacuuming vandalized clark gofundme hairdresser kron lafayette rusell russell salon shards targeted vacuuming vandalized clark gofundme hairdresser kron lafayette rusell russell salon shards targeted vacuuming vandalized", 
        "baltimore brew crimes documenting fbi form google harassment hate incident incidents propublica religion united baltimore brew crimes documenting fbi form google harassment hate incident incidents propublica religion united", 
        "alleges blaine court district gamel hitchcock jonita oklahoma pauls plaintiff renita robertson suit town alleges blaine court district gamel hitchcock jonita oklahoma pauls plaintiff renita robertson suit town alleges blaine court district gamel hitchcock jonita oklahoma pauls plaintiff renita robertson suit town alleges blaine court district gamel hitchcock jonita oklahoma pauls plaintiff renita robertson suit town", 
        "aireqzkjjz american bloomington bomb bureau carry concealed crime dayton fbi government islamic magazine marine mark missing morning mosque nber aireqzkjjz american bloomington bomb bureau carry concealed crime dayton fbi government islamic magazine marine mark missing morning mosque nber aireqzkjjz american bloomington bomb bureau carry concealed crime dayton fbi government islamic magazine marine mark missing morning mosque nber", 
        "adolf austria berlin china german hitler nazi nazis pictures reichstag salute salutes symbols tour adolf austria berlin china german hitler nazi nazis pictures reichstag salute salutes symbols tour adolf austria berlin china german hitler nazi nazis pictures reichstag salute salutes symbols tour", 
        "american bloomington cair dar dayton explosion farooq fbi government islamic minnesota mosque muslim unforgivable american bloomington cair dar dayton explosion farooq fbi government islamic minnesota mosque muslim unforgivable american bloomington cair dar dayton explosion farooq fbi government islamic minnesota mosque muslim unforgivable", 
        "blow crime deterrent hate legislation mosque north_dakota port prison reasons repetitions rob blow crime deterrent hate legislation mosque north_dakota port prison reasons repetitions rob", 
        "bloomington center dar dayton explosion farooq fbi islamic minneapolis minnesota mohamed mosque mosques omar shattered worshippers bloomington center dar dayton explosion farooq fbi islamic minneapolis minnesota mohamed mosque mosques omar shattered worshippers bloomington center dar dayton explosion farooq fbi islamic minneapolis minnesota mohamed mosque mosques omar shattered worshippers", 
        "", 
        "aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul", 
        "adolf austria berlin china german hitler nazi nazis pictures reichstag salute salutes symbols tour adolf austria berlin china german hitler nazi nazis pictures reichstag salute salutes symbols tour adolf austria berlin china german hitler nazi nazis pictures reichstag salute salutes symbols tour", 
        "belcamino cair dayton gov islamic merseal minneapolis minnesota mosque muslim paul pipress strib", 
        "american bloomington cair dar dayton explosion farooq fbi government islamic minnesota mosque muslim unforgivable american bloomington cair dar dayton explosion farooq fbi government islamic minnesota mosque muslim unforgivable american bloomington cair dar dayton explosion farooq fbi government islamic minnesota mosque muslim unforgivable", 
        "blow crime deterrent hate legislation mosque north_dakota port prison reasons repetitions rob blow crime deterrent hate legislation mosque north_dakota port prison reasons repetitions rob", 
        "bloomington center dar dayton explosion farooq fbi islamic minneapolis minnesota mohamed mosque mosques omar shattered worshippers bloomington center dar dayton explosion farooq fbi islamic minneapolis minnesota mohamed mosque mosques omar shattered worshippers bloomington center dar dayton explosion farooq fbi islamic minneapolis minnesota mohamed mosque mosques omar shattered worshippers", 
        "attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror attack bloomington dar dayton explosion farooq government islamic mark minnesota mosque pedroza press star terror", 
        "", 
        "aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul aksoy anti attack german headscarf islamic muslim taner trt yurdakul", 
        "africa american blaine district edsall fire gamel gay hate hitchcock lgbtq mayor medler oklahoma", 
        "blast bloomington dar dayton farooq fbi gofundme hate imam islamic minneapolis minnesota mosque perpetrator terror blast bloomington dar dayton farooq fbi gofundme hate imam islamic minneapolis minnesota mosque perpetrator terror", 
        "american bloomington bomb cair crime dar farooq fbi federal hate islamic minnesota startribune", 
        "beach cbs12 city cruz gay gays hate lake mena nelson palm pbso restaurant shooting worth", 
        "bloomington bomb dar election farooq fbi hate immigrants mark michigan minnesota mosque muslim swastikas trump whitehouse", 
        "airport attack bikers international jersey kennedy midnight motorcyclists police punched racially smashed woodbridge york airport attack bikers international jersey kennedy midnight motorcyclists police punched racially smashed woodbridge york", 
        "aby anti bigots bomb cities commission dar defend farooq hate islamic keirstead muslim neighbors racists twin war aby anti bigots bomb cities commission dar defend farooq hate islamic keirstead muslim neighbors racists twin war", 
        "beach city cruz edmondson figueroa florida gay lake mena murder office palm post prejudices shooting worth beach city cruz edmondson figueroa florida gay lake mena murder office palm post prejudices shooting worth", 
        "aggravated arrested beach carballo cbs12 crime cruz hate hernandez lake lerman murder palm restaurant west worth", 
        "advancement beit black bonforte colorado colored conference crimes exclusionary hate heil lowercase people rally sieg springs swastika temple advancement beit black bonforte colorado colored conference crimes exclusionary hate heil lowercase people rally sieg springs swastika temple", 
        "", 
        "", 
        "abc25 beach beers brenda cruz florida gay hernandez mena palm post rats restaurant shooting south witnesses", 
        "abc25 brenda carvallo cousin cruz gay hernandez juan mena nelson pedro witnesses abc25 brenda carvallo cousin cruz gay hernandez juan mena nelson pedro witnesses abc25 brenda carvallo cousin cruz gay hernandez juan mena nelson pedro witnesses abc25 brenda carvallo cousin cruz gay hernandez juan mena nelson pedro witnesses", 
        "attack bloomington dar dayton farooq goodman minnesota mohamed mosque omar president somalia trump worshipers attack bloomington dar dayton farooq goodman minnesota mohamed mosque omar president somalia trump worshipers attack bloomington dar dayton farooq goodman minnesota mohamed mosque omar president somalia trump worshipers", 
        "beach cruz flores florida friends gay gays hernandez homophobe javier killed mena nelson office palm pupuseria beach cruz flores florida friends gay gays hernandez homophobe javier killed mena nelson office palm pupuseria beach cruz flores florida friends gay gays hernandez homophobe javier killed mena nelson office palm pupuseria beach cruz flores florida friends gay gays hernandez homophobe javier killed mena nelson office palm pupuseria beach cruz flores florida friends gay gays hernandez homophobe javier killed mena nelson office palm pupuseria", 
        "american anti bias cair donald hate incidents islamic minnesota mosque mosques muslim president trump united", 
        "beach cbs12 cruz flores forester hate himmelheber juan lake palm pedro restaurant shooting thomas worth", 
        "american anti bias cair dayton government hate incidents islamic minnesota mosque mosques muslim president trump american anti bias cair dayton government hate incidents islamic minnesota mosque mosques muslim president trump", 
        "attack bomb building crimes eisenhower gorka israel minnesota msnbc perpetrator president trump whitehouse attack bomb building crimes eisenhower gorka israel minnesota msnbc perpetrator president trump whitehouse attack bomb building crimes eisenhower gorka israel minnesota msnbc perpetrator president trump whitehouse", 
        "allegedly cousin crime cruz flores florida friends gay homophobic juan lake mena people restaurant worth allegedly cousin crime cruz flores florida friends gay homophobic juan lake mena people restaurant worth allegedly cousin crime cruz flores florida friends gay homophobic juan lake mena people restaurant worth allegedly cousin crime cruz flores florida friends gay homophobic juan lake mena people restaurant worth", 
        "bradley brooks center commission community hate law lecia peoria poverty southern swastika tolerance university", 
        "ahussain american anti bomb dar extremism farooq fbi hilal islamic minnesota mosque muslim trump violence ahussain american anti bomb dar extremism farooq fbi hilal islamic minnesota mosque muslim trump violence ahussain american anti bomb dar extremism farooq fbi hilal islamic minnesota mosque muslim trump violence", 
        "cbs12 cbsmiami corballo cousin cruz flores gays hernandez juan lake mena pedro rats shooter worth cbs12 cbsmiami corballo cousin cruz flores gays hernandez juan lake mena pedro rats shooter worth cbs12 cbsmiami corballo cousin cruz flores gays hernandez juan lake mena pedro rats shooter worth cbs12 cbsmiami corballo cousin cruz flores gays hernandez juan lake mena pedro rats shooter worth", 
        "bloomington bomb comment crimes dayton fbi gorka gov hate minnesota mosque propagated sebastian terror trump whitehouse bloomington bomb comment crimes dayton fbi gorka gov hate minnesota mosque propagated sebastian terror trump whitehouse bloomington bomb comment crimes dayton fbi gorka gov hate minnesota mosque propagated sebastian terror trump whitehouse bloomington bomb comment crimes dayton fbi gorka gov hate minnesota mosque propagated sebastian terror trump whitehouse", 
        "arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor arab astoria attacker baghdadi eggs farid food hurled muslim queens steinway vendor", 
        "artist european german hamburg hate islamic israel jews nazi shahak shapira speech stencilling tweets twitter artist european german hamburg hate islamic israel jews nazi shahak shapira speech stencilling tweets twitter artist european german hamburg hate islamic israel jews nazi shahak shapira speech stencilling tweets twitter artist european german hamburg hate islamic israel jews nazi shahak shapira speech stencilling tweets twitter artist european german hamburg hate islamic israel jews nazi shahak shapira speech stencilling tweets twitter", 
        "bomb charliejmay crimes donald fake gorka hate minneapolis minnesota mosque msnbc president propagated sebastian trump whitehouse bomb charliejmay crimes donald fake gorka hate minneapolis minnesota mosque msnbc president propagated sebastian trump whitehouse bomb charliejmay crimes donald fake gorka hate minneapolis minnesota mosque msnbc president propagated sebastian trump whitehouse bomb charliejmay crimes donald fake gorka hate minneapolis minnesota mosque msnbc president propagated sebastian trump whitehouse bomb charliejmay crimes donald fake gorka hate minneapolis minnesota mosque msnbc president propagated sebastian trump whitehouse bomb charliejmay crimes donald fake gorka hate minneapolis minnesota mosque msnbc president propagated sebastian trump whitehouse bomb charliejmay crimes donald fake gorka hate minneapolis minnesota mosque msnbc president propagated sebastian trump whitehouse bomb charliejmay crimes donald fake gorka hate minneapolis minnesota mosque msnbc president propagated sebastian trump whitehouse", 
        "aajc american asia bitter choi crimes hate incidents lake north_korea racism seattle wareing wash yang", 
        "charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view charges francisco hate jogger judge latino mental moore ocean overstepped police russia taraval videotaped view", 
        "altering belong caitlyn disagree encouraged gender imagine jenner reassignment rejection altering belong caitlyn disagree encouraged gender imagine jenner reassignment rejection", 
        "ankur burgess city crime crimes fbi glickhouse hate hill incidents lasania mehta paper pittsburgh ankur burgess city crime crimes fbi glickhouse hate hill incidents lasania mehta paper pittsburgh", 
        "bloomington dar duluth farooq gorka harteau islamic minnesota mpr street strib trump whitehouse", 
        "american attack condemn crimes donald fake gorka hate minnesota msnbc muslim perpetrators president trump whitehouse", 
        "american amir attack blast bomb cair civil dayton director explosion gov hate islamic minnesota mosque muslim", 
        "adil ahmad amargah awantipora batpora bijweara bilal crpf dar drabgam kashmir lashker police pushkariri reader sirigufara sopore", 
        "american bullying buzzfeed classmates donald girl hate jewish latino mexico north_carolina president racism racist school trump white american bullying buzzfeed classmates donald girl hate jewish latino mexico north_carolina president racism racist school trump white american bullying buzzfeed classmates donald girl hate jewish latino mexico north_carolina president racism racist school trump white american bullying buzzfeed classmates donald girl hate jewish latino mexico north_carolina president racism racist school trump white", 
        "appeal brewer byrd circuit civil court east ellis evidence innocence jasper king texas trial appeal brewer byrd circuit civil court east ellis evidence innocence jasper king texas trial", 
        "car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming car crif facebook french halimi hate jewish jews jta levallois muslim paris perret ramming", 
        "africa american city government hardiman hate hiv illinois lgbt lgbtq times tio trans unity violence wct africa american city government hardiman hate hiv illinois lgbt lgbtq times tio trans unity violence wct africa american city government hardiman hate hiv illinois lgbt lgbtq times tio trans unity violence wct", 
        "alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman alliance ciaah conference crime crimes fair fhcci hate house incidents indiana law nelson ziedman", 
        "assaults attack blue crime criminal free governing hate justice louisiana matter newsletter perpetrator report subscribe tcr weekly assaults attack blue crime criminal free governing hate justice louisiana matter newsletter perpetrator report subscribe tcr weekly assaults attack blue crime criminal free governing hate justice louisiana matter newsletter perpetrator report subscribe tcr weekly assaults attack blue crime criminal free governing hate justice louisiana matter newsletter perpetrator report subscribe tcr weekly assaults attack blue crime criminal free governing hate justice louisiana matter newsletter perpetrator report subscribe tcr weekly", 
        "baghadadi baghdadi daily egged eggs farid grill halal hate kebab muslim nypd owner pix steinway truck baghadadi baghdadi daily egged eggs farid grill halal hate kebab muslim nypd owner pix steinway truck baghadadi baghdadi daily egged eggs farid grill halal hate kebab muslim nypd owner pix steinway truck", 
        "", 
        "aide bomb crime fake gorka hate minnesota mosque president sebastian trump", 
        "bloomington damage dar dayton evidence explosion farooq fbi gov islamic minnesota mosque omar thornton", 
        "amanullah attack charleston gorka islamic president roof sebastian supremacist terror trump whitehouse wing amanullah attack charleston gorka islamic president roof sebastian supremacist terror trump whitehouse wing amanullah attack charleston gorka islamic president roof sebastian supremacist terror trump whitehouse wing", 
        "", 
        "attack center crime gorka hassanen hate london minnesota mosque msnbc muslim nabra sebastian stabbing trump whitehouse attack center crime gorka hassanen hate london minnesota mosque msnbc muslim nabra sebastian stabbing trump whitehouse attack center crime gorka hassanen hate london minnesota mosque msnbc muslim nabra sebastian stabbing trump whitehouse attack center crime gorka hassanen hate london minnesota mosque msnbc muslim nabra sebastian stabbing trump whitehouse", 
        "", 
        "attack bloomington bomb crimes dar election fake farooq gorka hate islamic people president propagated rivaling ruhle trump whitehouse", 
        "arab brooklyn brother court emic erick file island judge manuel mental park pastuizaca rikers stabbing sunset arab brooklyn brother court emic erick file island judge manuel mental park pastuizaca rikers stabbing sunset", 
        "authorities biker family jersey minivan mirror motorcyclists punched racially smashed vans woodbridge", 
        "", 
        "american firebomb fornshill george gillespie hate klan letter mason nazi nelson neo sean supremacists synagogue university american firebomb fornshill george gillespie hate klan letter mason nazi nelson neo sean supremacists synagogue university american firebomb fornshill george gillespie hate klan letter mason nazi nelson neo sean supremacists synagogue university american firebomb fornshill george gillespie hate klan letter mason nazi nelson neo sean supremacists synagogue university american firebomb fornshill george gillespie hate klan letter mason nazi nelson neo sean supremacists synagogue university american firebomb fornshill george gillespie hate klan letter mason nazi nelson neo sean supremacists synagogue university american firebomb fornshill george gillespie hate klan letter mason nazi nelson neo sean supremacists synagogue university", 
        "american attack bloomington ellison flickr hate infects islamic minnesota muslim outrage president progress silence society trump american attack bloomington ellison flickr hate infects islamic minnesota muslim outrage president progress silence society trump american attack bloomington ellison flickr hate infects islamic minnesota muslim outrage president progress silence society trump", 
        "anti bias cair dayton government hate incidents islamic mark minnesota mosque mosques muslim president trump anti bias cair dayton government hate incidents islamic mark minnesota mosque mosques muslim president trump", 
        "bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words bata city crime crimes dakota fargoan german hate kinslow legislation matthew myhre north_korea school tefft valley words", 
        "activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech activist archbishop cna complaint efe ewtn francisco granada hate homily ideology javier lgbt spain spanish speech", 
        "", 
        "act bill class cleburne crimes dallas degree felony hate house johnson law mcbroom officers police protection texas", 
        "arab astoria crimes deplorable drive eggs food force hate immigrants muslim nypd owner task uber arab astoria crimes deplorable drive eggs food force hate immigrants muslim nypd owner task uber", 
        "", 
        "american bloomington bomb christian east hate intimidate middle minneapolis minnesota mosque mosques muslim politicians sectarian somalia somalis terror american bloomington bomb christian east hate intimidate middle minneapolis minnesota mosque mosques muslim politicians sectarian somalia somalis terror american bloomington bomb christian east hate intimidate middle minneapolis minnesota mosque mosques muslim politicians sectarian somalia somalis terror american bloomington bomb christian east hate intimidate middle minneapolis minnesota mosque mosques muslim politicians sectarian somalia somalis terror", 
        "bjs boulder colorado crimes documenting enforcement fbi hate incidents law project propublica track trump weekly bjs boulder colorado crimes documenting enforcement fbi hate incidents law project propublica track trump weekly", 
        "allan ambassador baby crime facebook hate marks peter police sawyer sergeant signs spencer toilet", 
        "astoria astorians baghdadi constantinides crimes egging farid force hate muslim nypd nypdcrimestoppers steinway task tip577 tips vendor astoria astorians baghdadi constantinides crimes egging farid force hate muslim nypd nypdcrimestoppers steinway task tip577 tips vendor astoria astorians baghdadi constantinides crimes egging farid force hate muslim nypd nypdcrimestoppers steinway task tip577 tips vendor astoria astorians baghdadi constantinides crimes egging farid force hate muslim nypd nypdcrimestoppers steinway task tip577 tips vendor", 
        "attack bridge british chief crime crimes finsbury hate incidents islamic london manchester national npcc police attack bridge british chief crime crimes finsbury hate incidents islamic london manchester national npcc police", 
        "attack bridge british crimes hate holden incidents islamic london manchester michael npcc police thomsonreuters attack bridge british crimes hate holden incidents islamic london manchester michael npcc police thomsonreuters", 
        "arena attack bridge chief crime crimes figures hate london manchester national npcc palace police terror westminster arena attack bridge chief crime crimes figures hate london manchester national npcc palace police terror westminster arena attack bridge chief crime crimes figures hate london manchester national npcc palace police terror westminster", 
        "attack bridge british chief crime figures finsbury hate incidents london manchester npcc park police terror westminster", 
        "alexandria baseball bat davis highway jail jefferson man michael potomac racist ready sentenced slur window yard alexandria baseball bat davis highway jail jefferson man michael potomac racist ready sentenced slur window yard alexandria baseball bat davis highway jail jefferson man michael potomac racist ready sentenced slur window yard alexandria baseball bat davis highway jail jefferson man michael potomac racist ready sentenced slur window yard alexandria baseball bat davis highway jail jefferson man michael potomac racist ready sentenced slur window yard alexandria baseball bat davis highway jail jefferson man michael potomac racist ready sentenced slur window yard", 
        "", 
        "africa alexandria assault bat code court crimes district general hate john michael motivated police probation race ready victims", 
        "", 
        "attack bridge crime finsbury hamilton hate london manchester national npcc park police westminster", 
        "city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station city elk fresno gas grove harfateh hate religion sacramento sikh sikhs simranjit singh station", 
        "africa alexandria american court district hate john man michael potomac racial ready sentenced slur victims yards yelled africa alexandria american court district hate john man michael potomac racial ready sentenced slur victims yards yelled africa alexandria american court district hate john man michael potomac racial ready sentenced slur victims yards yelled africa alexandria american court district hate john man michael potomac racial ready sentenced slur victims yards yelled africa alexandria american court district hate john man michael potomac racial ready sentenced slur victims yards yelled", 
        "ancestry bill delaware farnese gender legislature pennsylvania philadelphia religion sen sentinel supreme_court terroristic williams", 
        "africa american attorney charlotte escaped family fire franklin hate highland home homeowner house investigation office osage prosecuting racial west africa american attorney charlotte escaped family fire franklin hate highland home homeowner house investigation office osage prosecuting racial west africa american attorney charlotte escaped family fire franklin hate highland home homeowner house investigation office osage prosecuting racial west africa american attorney charlotte escaped family fire franklin hate highland home homeowner house investigation office osage prosecuting racial west africa american attorney charlotte escaped family fire franklin hate highland home homeowner house investigation office osage prosecuting racial west africa american attorney charlotte escaped family fire franklin hate highland home homeowner house investigation office osage prosecuting racial west", 
        "abdelhaid empowerment hate hijab initiative international muslim queens rana shoving teaches woman women yorker", 
        "act bill cleburne crimes dallas enforcement hate house johnson judge law mcbroom micah police protection texas", 
        "", 
        "attack bridge correspondent crime crimes finsbury hate john kingdom muslim npcc park police simpson terror westminster", 
        "anti backlash coalition hate homicides lgbt national ncavp orlando panfil program pulse trans transgender violence york anti backlash coalition hate homicides lgbt national ncavp orlando panfil program pulse trans transgender violence york anti backlash coalition hate homicides lgbt national ncavp orlando panfil program pulse trans transgender violence york anti backlash coalition hate homicides lgbt national ncavp orlando panfil program pulse trans transgender violence york anti backlash coalition hate homicides lgbt national ncavp orlando panfil program pulse trans transgender violence york", 
        "admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york admissions bias college history huffingtonpost jeff justice latino month national parental rawpixel sessions supporters times whitehouse whites york", 
        "", 
        "akhtar constables door gazettelive kamran messages neighbour racist scrawled white akhtar constables door gazettelive kamran messages neighbour racist scrawled white", 
        "2016 american anti coalition hate hispanic killed lgbt national nightclub program pulse rhetoric rise trans violence 2016 american anti coalition hate hispanic killed lgbt national nightclub program pulse rhetoric rise trans violence 2016 american anti coalition hate hispanic killed lgbt national nightclub program pulse rhetoric rise trans violence", 
        "bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin bloomington crawley dar farooq grassley hate islamic lavinsky linn minneapolis religion religious star sunderlin", 
        "", 
        "anti buzzfeed cisgender coalition hate homicide homicides killed lgbt lgbtq national orlando pulse tillery united violence", 
        "anti buzzfeed coalition hate homicides killed lgbt national nidhi prakash program pulse tillery trans transgender violence anti buzzfeed coalition hate homicides killed lgbt national nidhi prakash program pulse tillery trans transgender violence anti buzzfeed coalition hate homicides killed lgbt national nidhi prakash program pulse tillery trans transgender violence", 
        "advocacy anti buzzfeed cisgender coalition hate homicides impacting killed lgbtq national pulse transgender united violence advocacy anti buzzfeed cisgender coalition hate homicides impacting killed lgbtq national pulse transgender united violence", 
        "anti buzzfeed coalition hate homicides killed lgbtq national ncavp nightclub orlando pulse tillery transgender violence", 
        "american bigots christian crime fargo forks grand hate jimshawtv lgbt north_dakota ptfs somalia trump wday american bigots christian crime fargo forks grand hate jimshawtv lgbt north_dakota ptfs somalia trump wday", 
        "american bigots christian crime fargo forks grand hate jimshawtv lgbt north_dakota ptfs somalia trump wday american bigots christian crime fargo forks grand hate jimshawtv lgbt north_dakota ptfs somalia trump wday", 
        "2016 anti buzzfeed coalition hate homicides killed lgbt national ncavp nidhi prakash program pulse tillery violence 2016 anti buzzfeed coalition hate homicides killed lgbt national ncavp nidhi prakash program pulse tillery violence", 
        "american charlottesville confederate donald government hate nationalist presidend protest rally satuday trump university violent virginia xinhua american charlottesville confederate donald government hate nationalist presidend protest rally satuday trump university violent virginia xinhua", 
        "anti buzzfeed coalition hate homicides killed lgbt national panfill program pulse trans transgender trump violence york anti buzzfeed coalition hate homicides killed lgbt national panfill program pulse trans transgender trump violence york", 
        "advisor american bannon breitbart charlottesville condemn donald first hate melania president sides supremacists trump violence whitehouse", 
        "7am analysts charlottesville civil clashing daily fintech landmarks market milestones minutes racism ratings steeped supremacists symbolizes virginia war zing", 
        "albemarle charlottesville community counter cpr disarm downtown four jason kessler protest shock unrighteous violence water", 
        "charlottesville confederate father flocked founding jefferson kkk masculinity nazi nazis propping rally regalia thomas torches unite virgina white charlottesville confederate father flocked founding jefferson kkk masculinity nazi nazis propping rally regalia thomas torches unite virgina white charlottesville confederate father flocked founding jefferson kkk masculinity nazi nazis propping rally regalia thomas torches unite virgina white charlottesville confederate father flocked founding jefferson kkk masculinity nazi nazis propping rally regalia thomas torches unite virgina white charlottesville confederate father flocked founding jefferson kkk masculinity nazi nazis propping rally regalia thomas torches unite virgina white", 
        "american barack_obama bigotry charlottesville crooked donald eekly hillary insults marco supremacists terror trump white wincers american barack_obama bigotry charlottesville crooked donald eekly hillary insults marco supremacists terror trump white wincers american barack_obama bigotry charlottesville crooked donald eekly hillary insults marco supremacists terror trump white wincers", 
        "american charlottesville cicilline president rally rhode sen supremacists terror trump unite virginia white yelnosky", 
        "charlottesville confrontations faturechi hajj heimbach krinsky national police propublica protest robert state supremacists thompson virginia white charlottesville confrontations faturechi hajj heimbach krinsky national police propublica protest robert state supremacists thompson virginia white charlottesville confrontations faturechi hajj heimbach krinsky national police propublica protest robert state supremacists thompson virginia white charlottesville confrontations faturechi hajj heimbach krinsky national police propublica protest robert state supremacists thompson virginia white", 
        "affectation charlottesville earthward emancipation impotently jefferson kindergarteners marine nationalists nazi obnoxiously park protest thomas twits university violence virginia affectation charlottesville earthward emancipation impotently jefferson kindergarteners marine nationalists nazi obnoxiously park protest thomas twits university violence virginia affectation charlottesville earthward emancipation impotently jefferson kindergarteners marine nationalists nazi obnoxiously park protest thomas twits university violence virginia"
    ], 
    "Organization": [
        "WLKY Louisville", 
        "Danbury News Times", 
        "San Diego Gay & Lesbian News", 
        "muslimcommunityreport.com", 
        "Miami Herald", 
        "949whom.com", 
        "tennesseestar.com", 
        "The American Bazaar", 
        "Patheos", 
        "Billboard", 
        "Minnesota Public Radio News", 
        "Investorplace.com", 
        "The Bakersfield Californian", 
        "Bryan-College Station Eagle", 
        "WBFO", 
        "Washington Post", 
        "Reveal", 
        "ProPublica", 
        "avp.org", 
        "Lexington Herald Leader", 
        "Chicago Tribune", 
        "Metro Weekly", 
        "Philadelphia Sunday Sun", 
        "enumclaw.com", 
        "Business Insider", 
        "New York Daily News", 
        "Madison.com", 
        "Fredericksburg.com", 
        "The Daily Breeze", 
        "WDAZ", 
        "http://www.newsgram.com/", 
        "Salon", 
        "Chicago Tribune", 
        "Standard Republic", 
        "Newsline", 
        "The Daily Progress", 
        "The National Memo", 
        "KLTV", 
        "The Bozeman Daily Chronicle", 
        "Gettysburg Times", 
        "CBS Minnesota / WCCO", 
        "The Killeen Daily Herald", 
        "theartblog.org", 
        "KMTV - 3 News Now", 
        "The Tand D.com", 
        "USA TODAY", 
        "Human Rights Campaign", 
        "Blasting News", 
        "Business Insider", 
        "Detroit Free Press", 
        "Standard Republic", 
        "KRON4.com", 
        "Baltimore Brew", 
        "NonDoc", 
        "Patch.com", 
        "Carbonated.tv", 
        "Newsweek", 
        "INFORUM", 
        "Eagle-Tribune", 
        "sayanythingblog.com", 
        "TRT World", 
        "Carbonated.tv", 
        "MinnPost", 
        "Newsweek", 
        "INFORUM", 
        "Eagle-Tribune", 
        "New York Times", 
        "sayanythingblog.com", 
        "TRT World", 
        "Dallas Voice", 
        "KESQ", 
        "ColorLines magazine", 
        "WPEC", 
        "Legal Examiner", 
        "Fort Bend Herald", 
        "Fight Back! Newspaper", 
        "Palm Beach Post", 
        "WPEC", 
        "Colorado Springs Independent", 
        "850wftl.com", 
        "sabanorthamerica.com", 
        "Newburgh Gazette", 
        "LGBTQ Nation", 
        "Democracy Now!", 
        "PerezHilton.com", 
        "Washington Post", 
        "WPEC", 
        "Reading Eagle", 
        "ThinkProgress", 
        "PEOPLE.com", 
        "The Community Word", 
        "Mic", 
        "CBS Miami", 
        "Washington Examiner", 
        "New York Daily News", 
        "Fortune", 
        "Salon", 
        "The International Examiner", 
        "NBC Bay Area", 
        "Washington Times", 
        "PGH City Paper", 
        "MinnPost", 
        "Newsweek", 
        "HiTechFacts", 
        "registrarjournal.com", 
        "BuzzFeed News", 
        "McClatchy Washington Bureau", 
        "Jewish Telegraphic Agency", 
        "Windy City Times", 
        "NUVO", 
        "Crime Report", 
        "Eater NY", 
        "shotinthedark.info", 
        "CNN", 
        "Minnesota Lawyer", 
        "Newsweek", 
        "simmsshowerslaw.com", 
        "Mic", 
        "longislandtechnologynews.com", 
        "Hi-tech Beacon", 
        "Brooklyn Daily Eagle", 
        "Fort Bend Herald", 
        "Catholic Culture", 
        "Washington Post", 
        "Common Dreams", 
        "Berkshire Eagle", 
        "High Plains Reader", 
        "Catholic News Agency", 
        "newyorknewsinfo.com", 
        "Cleburne Times-Review", 
        "QNS.com", 
        "Thenewjournalandguide", 
        "HuffPost", 
        "Boulder Weekly", 
        "Breitbart News", 
        "Queens Chronicle", 
        "Reuters", 
        "Nasdaq", 
        "BuzzFeed News", 
        "Clacton and Frinton Gazette", 
        "Washington Post", 
        "avp.org", 
        "Alexandrianews.org", 
        "avp.org", 
        "BBC News", 
        "Sacramento Bee", 
        "Patch.com", 
        "The Courier-Express", 
        "fox2now.com", 
        "New York Post", 
        "Kokomo Tribune", 
        "avp.org", 
        "ExpressNewsline", 
        "BuzzFeed News", 
        "Press Herald", 
        "sayanythingblog.com", 
        "Breitbart News", 
        "The Ring of Fire Network", 
        "The Gazette: Eastern Iowa Breaking News and Headlines", 
        "jewishnewsva.org", 
        "Papermag", 
        "The New Civil Rights Movement", 
        "Out Magazine", 
        "Bustle", 
        "INFORUM", 
        "INFORUM", 
        "Unicorn Booty", 
        "Gears Of Biz", 
        "Unicorn Booty", 
        "Fortune", 
        "Benzinga", 
        "The Daily Progress", 
        "HuffPost", 
        "HuffPost", 
        "The Providence Journal", 
        "ProPublica", 
        "HuffPost"
    ]
}